fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <PubSubClient.h>
#include <ArduinoOTA.h>
#include <WebServer.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include <Update.h>
#include <ESP32Ping.h>
#include <time.h>
#include <vector>

// ---- Firmware Version ----
const char* FIRMWARE_VERSION = "2.0.2";

// ---- ANSI Farb-Codes für Serial Monitor (deaktiviert für reine Text-Ausgabe) ----
#define ANSI_RESET   ""
#define ANSI_BOLD    ""
#define ANSI_RED     ""
#define ANSI_GREEN   ""
#define ANSI_YELLOW  ""
#define ANSI_BLUE    ""
#define ANSI_MAGENTA ""
#define ANSI_CYAN    ""
#define ANSI_WHITE   ""

// ---- Konfiguration ----
char ssid[32] = "SSID";
char password[64] = "Password";
char hostname[32] = "ESP32-GasZaehler"; // mDNS Hostname
char mqtt_server[64] = "192.168.178.1"; // MQTT Broker IP
int mqtt_port = 1883;
char mqtt_user[64] = ""; // MQTT Username (optional)
char mqtt_pass[64] = ""; // MQTT Password (optional)
char mqtt_topic[64] = "gaszaehler/verbrauch";
char mqtt_availability_topic[64] = "gaszaehler/availability";
char mqtt_client_id[32] = "ESP32GasClient";
unsigned long poll_interval = 30000; // Standard: 30 Sekunden
float gas_calorific_value = 10.0; // kWh/m - Brennwert (typisch 8-12 kWh/m)
float gas_correction_factor = 1.0; // Z-Zahl Korrekturfaktor (typisch 0.95-1.0)
bool use_static_ip = false;
char static_ip[16] = "192.168.1.100";
char static_gateway[16] = "192.168.1.1";
char static_subnet[16] = "255.255.255.0";
char static_dns[16] = "192.168.1.1";

// ---- Deep Sleep Konfiguration ----
bool enable_deep_sleep = false;
unsigned long deep_sleep_duration = 300; // Sekunden (5 Minuten)
unsigned long last_activity = 0;
const unsigned long INACTIVITY_TIMEOUT = 600000; // 10 Minuten keine Aktivitt

Preferences preferences;
Preferences historyPrefs;
bool haDiscoverySent = false;

// ---- WiFi AP Mode ----
bool apMode = false;
const char* ap_ssid = "ESP32-GasZaehler";
const char* ap_password = ""; // Mindestens 8 Zeichen
const unsigned long AP_MODE_TIMEOUT = 300000; // 5 Minuten im AP-Modus

// ---- Status LED ----
const int STATUS_LED_PIN = 2; // Onboard LED (GPIO2)
unsigned long lastLedBlink = 0;
bool ledState = false;

// ---- Config Reset Button ----
const int RESET_BUTTON_PIN = 0; // BOOT Button (GPIO0)

// ---- NTP Zeitserver ----
const char* ntpServer = "de.pool.ntp.org";
const long gmtOffset_sec = 3600; // UTC+1 (MEZ)
const int daylightOffset_sec = 3600; // Automatisch erkannt
bool timeInitialized = false;

// Automatische Sommerzeit-Erkennung fr Europa
bool isDST(time_t now) {
  struct tm timeinfo;
  localtime_r(&now, &timeinfo);
  int month = timeinfo.tm_mon + 1;
  int day = timeinfo.tm_mday;
  int dow = timeinfo.tm_wday; // 0=Sonntag
  
  // Oktober bis Mrz: Winterzeit
  if (month < 3 || month > 10) return false;
  // April bis September: Sommerzeit
  if (month > 3 && month < 10) return true;
  
  // Mrz: Sommerzeit ab letztem Sonntag 2 Uhr
  if (month == 3) {
    int lastSunday = day - dow;
    while (lastSunday + 7 <= 31) lastSunday += 7;
    return day >= lastSunday;
  }
  
  // Oktober: Winterzeit ab letztem Sonntag 3 Uhr
  if (month == 10) {
    int lastSunday = day - dow;
    while (lastSunday + 7 <= 31) lastSunday += 7;
    return day < lastSunday;
  }
  
  return false;
}

// ---- Error Tracking ----
struct ErrorStats {
  unsigned long mbusTimeouts = 0;
  unsigned long mbusParseErrors = 0;
  unsigned long mqttErrors = 0;
  unsigned long wifiDisconnects = 0;
  unsigned long lastError = 0;
  char lastErrorMsg[64] = "";
};
ErrorStats errorStats;

// ---- M-Bus Statistics ----
struct MBusStats {
  unsigned long totalPolls = 0;
  unsigned long successfulPolls = 0;
  unsigned long totalResponseTime = 0;
  unsigned long lastResponseTime = 0;
  unsigned long avgResponseTime = 0;
  String lastHexDump = "";
};
MBusStats mbusStats;

String lastErrorMessage = "";

// ---- Live Log System ----
const int MAX_LOG_ENTRIES = 50;
struct LogEntry {
  unsigned long timestamp;
  String message;
};
std::vector<LogEntry> logBuffer;

void addLog(const String& msg) {
  // ANSI-Codes aus der Nachricht entfernen für WebUI (nur im logBuffer)
  String cleanMsg = msg;
  cleanMsg.replace("\033[0m", "");   // ANSI_RESET
  cleanMsg.replace("\033[1m", "");   // ANSI_BOLD
  cleanMsg.replace("\033[31m", "");  // ANSI_RED
  cleanMsg.replace("\033[32m", "");  // ANSI_GREEN
  cleanMsg.replace("\033[33m", "");  // ANSI_YELLOW
  cleanMsg.replace("\033[34m", "");  // ANSI_BLUE
  cleanMsg.replace("\033[35m", "");  // ANSI_MAGENTA
  cleanMsg.replace("\033[36m", "");  // ANSI_CYAN
  cleanMsg.replace("\033[37m", "");  // ANSI_WHITE
  
  LogEntry entry;
  entry.timestamp = millis();
  entry.message = cleanMsg;
  logBuffer.push_back(entry);
  
  // Ringbuffer: alte Einträge löschen
  if (logBuffer.size() > MAX_LOG_ENTRIES) {
    logBuffer.erase(logBuffer.begin());
  }
  
  // Serial Output mit echter Zeit wenn verfügbar (mit ANSI-Codes)
  if (timeInitialized) {
    time_t now = time(nullptr);
    struct tm timeinfo;
    localtime_r(&now, &timeinfo);
    char timeStr[20];
    strftime(timeStr, sizeof(timeStr), "%H:%M:%S", &timeinfo);
    Serial.println(String("[") + timeStr + "] " + msg);
  } else {
    Serial.println("[" + String(millis()/1000) + "s] " + msg);
  }
}

WiFiClient espClient;
PubSubClient client(espClient);
WebServer server(80);
const size_t OTA_BUFFER_SIZE = 1460;

// ---- Verlaufsdaten ----
struct MeasurementData {
  unsigned long timestamp;
  float volume;
};
std::vector<MeasurementData> measurements;
const size_t MAX_MEASUREMENTS = 50;
float lastVolume = -1;
unsigned long lastMemoryCheck = 0;
const unsigned long MEMORY_CHECK_INTERVAL = 60000; // Jede Minute

// ---- M-Bus UART ----
HardwareSerial mbusSerial(1); // UART1
const int MBUS_RX_PIN = 16;   // GPIO16 (RX2) fr ESP32 DevKit V1
const int MBUS_TX_PIN = 17;   // GPIO17 (TX2) fr ESP32 DevKit V1
const long MBUS_BAUD = 2400;

// ---- MBUS State Maschine ----
enum MBusState { MBUS_IDLE, MBUS_WAIT_RESPONSE };
MBusState mbusState = MBUS_IDLE;
unsigned long mbusLastAction = 0;
const unsigned long MBUS_RESPONSE_TIMEOUT = 500; // ms

