fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
uint8_t mbusBuffer[256];
size_t mbusLen = 0;

// ---- Konfiguration laden/speichern ----
void loadConfig() {
  if (!preferences.begin("gas-config", false)) {
    Serial.println("ERROR: Konnte gas-config Namespace nicht oeffnen!");
    return;
  }
  
  // Prfen ob bereits konfiguriert wurde (config_done Flag)
  bool configDone = preferences.getBool("config_done", false);
  
  preferences.getString("ssid", ssid, sizeof(ssid));
  preferences.getString("password", password, sizeof(password));
  preferences.getString("hostname", hostname, sizeof(hostname));
  preferences.getString("mqtt_server", mqtt_server, sizeof(mqtt_server));
  mqtt_port = preferences.getInt("mqtt_port", 1883);
  preferences.getString("mqtt_user", mqtt_user, sizeof(mqtt_user));
  preferences.getString("mqtt_pass", mqtt_pass, sizeof(mqtt_pass));
  preferences.getString("mqtt_topic", mqtt_topic, sizeof(mqtt_topic));
  poll_interval = preferences.getULong("poll_interval", 30000);
  Serial.println("DEBUG loadConfig: poll_interval aus Flash = " + String(poll_interval) + " ms");
  gas_calorific_value = preferences.getFloat("gas_calorific", 10.0);
  gas_correction_factor = preferences.getFloat("gas_correction", 1.0);
  use_static_ip = preferences.getBool("use_static_ip", false);
  preferences.getString("static_ip", static_ip, sizeof(static_ip));
  preferences.getString("static_gateway", static_gateway, sizeof(static_gateway));
  preferences.getString("static_subnet", static_subnet, sizeof(static_subnet));
  preferences.getString("static_dns", static_dns, sizeof(static_dns));
  preferences.end();
  
  // Verlaufsdaten aus Flash laden
  // Erst versuchen mit read-write zu oeffnen um Namespace zu erstellen falls noetig
  if (!historyPrefs.begin("gas-history", false)) {
    Serial.println("WARN: Konnte gas-history Namespace nicht oeffnen/erstellen");
  }
  size_t dataCount = historyPrefs.getUInt("count", 0);
  
  // Validierung: Nicht mehr als MAX_MEASUREMENTS laden
  if (dataCount > MAX_MEASUREMENTS) {
    Serial.println("WARNUNG: Zu viele gespeicherte Daten (" + String(dataCount) + "), limitiere auf " + String(MAX_MEASUREMENTS));
    dataCount = MAX_MEASUREMENTS;
  }
  
  if (dataCount > 0) {
    Serial.println("Lade gespeicherte Verlaufsdaten: " + String(dataCount) + " Eintraege");
    measurements.clear(); // Sicherstellen dass leer
    
    for (size_t i = 0; i < dataCount; i++) {
      char key[16];
      
      snprintf(key, sizeof(key), "ts_%d", i);
      unsigned long timestamp = historyPrefs.getULong(key, 0);
      
      snprintf(key, sizeof(key), "vol_%d", i);
      float volume = historyPrefs.getFloat(key, 0.0);
      
      // Nur valide Werte laden
      if (timestamp > 0 && volume >= 0 && volume < 999999) {
        measurements.push_back({timestamp, volume});
      }
    }
    
    Serial.println("Erfolgreich " + String(measurements.size()) + " Messwerte geladen");
  }
  historyPrefs.end();
  
  // Validierung: Poll-Intervall muss zwischen 10s und 5min liegen.
  // Wenn im Flash ein ungültiger (z.B. 0) Wert gespeichert wurde, fallback auf 30s.
  Serial.println("DEBUG loadConfig: poll_interval vor Validierung = " + String(poll_interval) + " ms");
  if (poll_interval < 10000) {
    Serial.println("WARN: Ungueltiger poll_interval im Flash: " + String(poll_interval) + " ms - setze auf Default 30000 ms");
    poll_interval = 30000; // Fallback auf 30s statt 10s, um unerwartete 10s-Reset zu vermeiden
  }
  if (poll_interval > 300000) poll_interval = 300000; // Maximum 5min
  Serial.println("DEBUG loadConfig: poll_interval nach Validierung = " + String(poll_interval) + " ms");
  
  // Wenn noch nie konfiguriert oder SSID leer -> Defaults setzen
  if (!configDone || strlen(ssid) == 0) {
    Serial.println("Keine gltige Konfiguration gefunden - verwende Defaults");
    strcpy(ssid, "SSID");
    strcpy(password, "Password");
  }
  
  // Fallback auf Defaults wenn leer
  if (strlen(hostname) == 0) strcpy(hostname, "ESP32-GasZaehler");
  if (strlen(mqtt_server) == 0) strcpy(mqtt_server, "192.168.178.1");
  if (strlen(mqtt_topic) == 0) strcpy(mqtt_topic, "gaszaehler/verbrauch");
  
  // Availability Topic generieren
  snprintf(mqtt_availability_topic, sizeof(mqtt_availability_topic), "%s_availability", mqtt_topic);
}

void saveConfig() {
  // Validierung vor dem Speichern
  Serial.println("DEBUG saveConfig: poll_interval vor Validierung = " + String(poll_interval) + " ms");
  if (poll_interval < 10000) poll_interval = 10000;
  if (poll_interval > 300000) poll_interval = 300000; // Max 5min
  Serial.println("DEBUG saveConfig: poll_interval nach Validierung = " + String(poll_interval) + " ms");
  
  preferences.begin("gas-config", false);
  preferences.putString("ssid", ssid);
  preferences.putString("password", password);
  preferences.putString("hostname", hostname);
  preferences.putString("mqtt_server", mqtt_server);
  preferences.putInt("mqtt_port", mqtt_port);
  preferences.putString("mqtt_user", mqtt_user);
  preferences.putString("mqtt_pass", mqtt_pass);
  preferences.putString("mqtt_topic", mqtt_topic);
  preferences.putULong("poll_interval", poll_interval);
  // Readback of poll_interval before end()
  unsigned long rb_after = preferences.getULong("poll_interval", 0);
  preferences.putFloat("gas_calorific", gas_calorific_value);
  preferences.putFloat("gas_correction", gas_correction_factor);
  preferences.putBool("use_static_ip", use_static_ip);
  preferences.putString("static_ip", static_ip);
  preferences.putString("static_gateway", static_gateway);
  preferences.putString("static_subnet", static_subnet);
  preferences.putString("static_dns", static_dns);
  preferences.putBool("config_done", true); // Markiere als konfiguriert
  preferences.end();

  Serial.println("Konfiguration gespeichert");
  Serial.println("Poll-Intervall: " + String(poll_interval / 1000) + "s (" + String(poll_interval) + "ms) saved_readback=" + String(rb_after) + " ms");
}

// ---- Persistent Data Storage ----
void saveHistory() {
  historyPrefs.begin("gas-history", false);
  
  // Alte Daten lschen
  historyPrefs.clear();
  
  // Anzahl speichern
  size_t saveCount = min(measurements.size(), (size_t)MAX_MEASUREMENTS);
  historyPrefs.putUInt("count", saveCount);
  
