fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
  // Neueste Messwerte speichern
  for (size_t i = 0; i < saveCount; i++) {
    size_t idx = measurements.size() - saveCount + i; // Die neuesten X Werte
    char key[16];
    
    snprintf(key, sizeof(key), "ts_%d", i);
    historyPrefs.putULong(key, measurements[idx].timestamp);
    
    snprintf(key, sizeof(key), "vol_%d", i);
    historyPrefs.putFloat(key, measurements[idx].volume);
  }
  
  historyPrefs.end();
  Serial.println("History gespeichert: " + String(saveCount) + " Eintraege");
}

// ---- Fehler loggen ----
void logError(const char* msg) {
  errorStats.lastError = millis();
  strncpy(errorStats.lastErrorMsg, msg, sizeof(errorStats.lastErrorMsg) - 1);
  errorStats.lastErrorMsg[sizeof(errorStats.lastErrorMsg) - 1] = '\0';
  Serial.print("ERROR: ");
  Serial.println(msg);
}

// ---- Memory Leak Prevention ----
void checkMemory() {
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t minFreeHeap = ESP.getMinFreeHeap();
  uint32_t heapSize = ESP.getHeapSize();
  
  // Warnung wenn weniger als 10KB frei
  if (freeHeap < 10240) {
    Serial.println("WARNUNG: Wenig freier Speicher: " + String(freeHeap) + " Bytes");
    
    // Notfall: Alte Logs lschen
    if (logBuffer.size() > 20) {
      size_t oldSize = logBuffer.size();
      logBuffer.erase(logBuffer.begin(), logBuffer.begin() + 10);
      Serial.println("Notfall-Cleanup: " + String(oldSize - logBuffer.size()) + " alte Logs gelscht");
    }
    
    // Notfall: Alte Messwerte lschen
    if (measurements.size() > 30 && freeHeap < 5120) {
      size_t oldSize = measurements.size();
      measurements.erase(measurements.begin(), measurements.begin() + 10);
      Serial.println("Notfall-Cleanup: " + String(oldSize - measurements.size()) + " alte Messwerte gelscht");
      // Flash auch aktualisieren
      saveHistory();
    }
  }
  
  //KRITISCH: Neustart wenn < 3KB
  if (freeHeap < 3072) {
    Serial.println("KRITISCH: Extrem wenig RAM! Speichere Daten und starte neu...");
    saveHistory();
    delay(1000);
    ESP.restart();
  }
  
  // Statistik ausgeben
  float heapUsage = ((heapSize - freeHeap) * 100.0) / heapSize;
  Serial.println("Heap: Free=" + String(freeHeap) + " Min=" + String(minFreeHeap) + 
                 " Usage=" + String(heapUsage, 1) + "% | " +
                 "Logs=" + String(logBuffer.size()) + " Measurements=" + String(measurements.size()));
}

// ---- Status LED ----
void updateStatusLED() {
  unsigned long now = millis();
  
  if (apMode) {
    // Sehr schnelles Blinken: AP-Modus aktiv
    if (now - lastLedBlink >= 100) {
      ledState = !ledState;
      digitalWrite(STATUS_LED_PIN, ledState ? HIGH : LOW);
      lastLedBlink = now;
    }
  } else if (WiFi.status() != WL_CONNECTED) {
    // Schnelles Blinken: WLAN Problem
    if (now - lastLedBlink >= 200) {
      ledState = !ledState;
      digitalWrite(STATUS_LED_PIN, ledState ? HIGH : LOW);
      lastLedBlink = now;
    }
  } else if (!client.connected()) {
    // Mittleres Blinken: MQTT Problem
    if (now - lastLedBlink >= 500) {
      ledState = !ledState;
      digitalWrite(STATUS_LED_PIN, ledState ? HIGH : LOW);
      lastLedBlink = now;
    }
  } else {
    // Langsames Blinken: Alles OK
    if (now - lastLedBlink >= 2000) {
      ledState = !ledState;
      digitalWrite(STATUS_LED_PIN, ledState ? HIGH : LOW);
      lastLedBlink = now;
    }
  }
}

// ---- Forward declarations ----
void startAPMode();

// ---- WLAN Setup ----
void setup_wifi() {
  // Wenn SSID "SSID" ist, direkt in AP-Modus gehen
  if (strcmp(ssid, "SSID") == 0 || strlen(ssid) == 0) {
    Serial.println("Keine WLAN-Konfiguration gefunden. Starte Access Point...");
    startAPMode();
    return;
  }
  
  WiFi.mode(WIFI_STA);
  WiFi.setHostname(hostname);
  
  // Static IP konfigurieren falls aktiviert
  if (use_static_ip) {
    IPAddress ip, gateway, subnet, dns;
    ip.fromString(static_ip);
    gateway.fromString(static_gateway);
    subnet.fromString(static_subnet);
    dns.fromString(static_dns);
    if (!WiFi.config(ip, gateway, subnet, dns)) {
      Serial.println("Static IP Konfiguration fehlgeschlagen!");
    } else {
      Serial.println("Static IP konfiguriert: " + String(static_ip));
    }
  }
  
  WiFi.begin(ssid, password);
  Serial.print("Verbinde mit WLAN: ");
  Serial.println(ssid);
  
  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("Verbunden! IP: ");
    Serial.println(WiFi.localIP());
    addLog("WiFi verbunden: " + WiFi.localIP().toString());
    apMode = false;
  } else {
    Serial.println("WLAN-Verbindung fehlgeschlagen!");
    addLog("WiFi: Verbindung zu " + String(ssid) + " fehlgeschlagen");
    logError("WLAN Verbindung fehlgeschlagen");
    Serial.println("Starte Access Point fr Konfiguration...");
    addLog("Starte Access Point Modus");
    startAPMode();
  }
}

// ---- Access Point Modus starten ----
void startAPMode() {
  WiFi.mode(WIFI_AP);
  WiFi.softAP(ap_ssid, ap_password);
  
  IPAddress IP = WiFi.softAPIP();
  Serial.println("\n========================================");
  Serial.println("   ACCESS POINT MODUS AKTIV");
  Serial.println("========================================");
  Serial.print("SSID: ");
  Serial.println(ap_ssid);
  Serial.print("Passwort: ");
  Serial.println(ap_password);
  Serial.print("IP-Adresse: ");
  Serial.println(IP);
  Serial.println("\nVerbinden Sie sich mit dem Access Point");
  Serial.println("und ffnen Sie http://" + IP.toString());
  Serial.println("========================================\n");
  
  apMode = true;
}

// ---- MQTT Reconnect ----
void reconnect() {
  static unsigned long lastAttempt = 0;
  unsigned long now = millis();
  
  // Nur alle 5 Sekunden versuchen
  if (now - lastAttempt < 5000) {
    return;
  }
  
  lastAttempt = now;
  
  if (!client.connected()) {
    String authInfo = (strlen(mqtt_user) > 0) ? " (Auth: " + String(mqtt_user) + ")" : " (ohne Auth)";
    addLog("MQTT: Verbinde zu " + String(mqtt_server) + ":" + String(mqtt_port) + authInfo);
    
    // Last Will Testament fr automatische Offline-Erkennung
    bool connected = false;
    if (strlen(mqtt_user) > 0) {
      // Mit Authentifizierung
      connected = client.connect(mqtt_client_id, mqtt_user, mqtt_pass, mqtt_availability_topic, 1, true, "offline");
    } else {
      // Ohne Authentifizierung
      connected = client.connect(mqtt_client_id, mqtt_availability_topic, 1, true, "offline");
    }
    
    if (connected) {
      addLog("MQTT: Verbunden!");
      
      // Online Status senden
      client.publish(mqtt_availability_topic, "online", true);
      
      // Fehler-Counter zurcksetzen bei erfolgreicher Verbindung
      if (errorStats.mqttErrors > 0) {
        addLog("MQTT: Verbindung wiederhergestellt (" + String(errorStats.mqttErrors) + " vorherige Fehler)");
        errorStats.mqttErrors = 0; // Counter zurücksetzen
      }
      
