fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
      haDiscoverySent = false; // Discovery neu senden nach Reconnect
    } else {
      String errMsg = "MQTT: Fehler rc=" + String(client.state());
      if (client.state() == 5) errMsg += " (Authentifizierung fehlgeschlagen)";
      addLog(errMsg);
      errorStats.mqttErrors++;
      logError("MQTT Verbindung fehlgeschlagen");
    }
  }
}

// ---- Home Assistant Auto-Discovery ----
void sendHomeAssistantDiscovery() {
  if (haDiscoverySent) return;
  
  // Alte Entities mit falscher Schreibweise löschen (gaszahler ohne "e")
  client.publish("homeassistant/sensor/gaszahler_gasverbrauch/config", "", true);
  client.publish("homeassistant/sensor/gaszahler_zahlerstand/config", "", true);
  client.publish("homeassistant/sensor/gaszahler_wifi/config", "", true);
  client.publish("homeassistant/sensor/gaszahler_m_bus_rate/config", "", true);
  client.publish("homeassistant/binary_sensor/gaszahler_online/config", "", true);
  delay(300);
  
  String dev = "{\"ids\":[\"esp32_gas\"],\"name\":\"Gaszähler\",\"mdl\":\"BK-G4\",\"mf\":\"ESP32\",\"sw\":\"" + String(FIRMWARE_VERSION) + "\"}";
  
  // 1. Gas Volume (m³ auf mqtt_topic)
  String p1 = "{\"name\":\"Zählerstand\",\"stat_t\":\"" + String(mqtt_topic) + "\",\"avty_t\":\"" + String(mqtt_availability_topic) + "\",\"unit_of_meas\":\"m³\",\"dev_cla\":\"gas\",\"stat_cla\":\"total_increasing\",\"val_tpl\":\"{{ value|float }}\",\"uniq_id\":\"esp32_gaszaehler_zaehlerstand\",\"dev\":" + dev + "}";
  client.publish("homeassistant/sensor/esp32_gaszaehler_zaehlerstand/config", p1.c_str(), true);
  delay(100);
  
  // 2. Energy (kWh auf mqtt_topic_energy)
  String p2 = "{\"name\":\"Gasverbrauch\",\"stat_t\":\"" + String(mqtt_topic) + "_energy\",\"avty_t\":\"" + String(mqtt_availability_topic) + "\",\"unit_of_meas\":\"kWh\",\"dev_cla\":\"energy\",\"stat_cla\":\"total_increasing\",\"val_tpl\":\"{{ value|float }}\",\"uniq_id\":\"esp32_gaszaehler_gasverbrauch\",\"dev\":" + dev + "}";
  client.publish("homeassistant/sensor/esp32_gaszaehler_gasverbrauch/config", p2.c_str(), true);
  delay(100);
  
  // 3. WiFi
  String p3 = "{\"name\":\"WiFi\",\"stat_t\":\"" + String(mqtt_topic) + "_wifi\",\"avty_t\":\"" + String(mqtt_availability_topic) + "\",\"unit_of_meas\":\"dBm\",\"dev_cla\":\"signal_strength\",\"val_tpl\":\"{{ value }}\",\"uniq_id\":\"esp32_gaszaehler_wifi\",\"dev\":" + dev + "}";
  client.publish("homeassistant/sensor/esp32_gaszaehler_wifi/config", p3.c_str(), true);
  delay(100);
  
  // 4. M-Bus Rate
  String p4 = "{\"name\":\"M-Bus Rate\",\"stat_t\":\"" + String(mqtt_topic) + "_mbus_rate\",\"avty_t\":\"" + String(mqtt_availability_topic) + "\",\"unit_of_meas\":\"%\",\"val_tpl\":\"{{ value }}\",\"ic\":\"mdi:check-network\",\"uniq_id\":\"esp32_gaszaehler_mbus\",\"dev\":" + dev + "}";
  client.publish("homeassistant/sensor/esp32_gaszaehler_mbus/config", p4.c_str(), true);
  delay(100);
  
  // 5. Online
  String p5 = "{\"name\":\"Online\",\"stat_t\":\"" + String(mqtt_availability_topic) + "\",\"pl_on\":\"online\",\"pl_off\":\"offline\",\"dev_cla\":\"connectivity\",\"uniq_id\":\"esp32_gaszaehler_online\",\"dev\":" + dev + "}";
  client.publish("homeassistant/binary_sensor/esp32_gaszaehler_online/config", p5.c_str(), true);
  
  Serial.println("HA Discovery gesendet (5 Entities)");
  Serial.println("Sensoren werden nach der ersten M-Bus Messung sichtbar!");
  Serial.println("Topics:");
  Serial.println("  - Volume: " + String(mqtt_topic));
  Serial.println("  - Energy: " + String(mqtt_topic) + "_energy");
  Serial.println("  - WiFi: " + String(mqtt_topic) + "_wifi");
  Serial.println("  - M-Bus Rate: " + String(mqtt_topic) + "_mbus_rate");
  Serial.println("  - Availability: " + String(mqtt_availability_topic));
  Serial.println("Brennwert: " + String(gas_calorific_value, 6) + " kWh/m³, Z-Zahl: " + String(gas_correction_factor, 6));
  haDiscoverySent = true;
}

// ---- BCD Parser fr Gaszhler ----
float parseGasVolumeBCD(const uint8_t* data, size_t len) {
    for (size_t i = 0; i + 5 < len; i++) {
        if (data[i] == 0x0C && data[i+1] == 0x13) { // DIF=0x0C, VIF=0x13
            uint32_t value = 0;
            uint32_t factor = 1;
            for (int b = 0; b < 4; b++) {
                uint8_t byte = data[i+2+b];
                uint8_t lsn = byte & 0x0F;
                uint8_t msn = (byte >> 4) & 0x0F;
                value += lsn * factor; factor *= 10;
                value += msn * factor; factor *= 10;
            }
            return value / 1000.0; // 2 Dezimalstellen  m
        }
    }
    return -1; // nicht gefunden
}

// ---- OTA Setup ----
void setupOTA() {
  ArduinoOTA.setHostname("esp32-gas");
  ArduinoOTA.onStart([]() { Serial.println("Start OTA Update"); });
  ArduinoOTA.onEnd([]() { Serial.println("\nOTA Ende"); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("Fortschritt: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("OTA Fehler[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth fehlgeschlagen");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin fehlgeschlagen");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Verbindung fehlgeschlagen");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Empfang fehlgeschlagen");
    else if (error == OTA_END_ERROR) Serial.println("End fehlgeschlagen");
  });
  ArduinoOTA.begin();
  Serial.println("OTA bereit");
}

// ---- WebServer Handler ----
const char* htmlPage = R"rawliteral(
<!DOCTYPE html>
<html lang="de">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Gaszaehler Monitor</title>
  <script src="https://cdn.jsdelivr.net/npm/chart.js@4.4.0/dist/chart.umd.min.js"></script>
  <script src="https://cdn.jsdelivr.net/npm/chartjs-adapter-date-fns@3.0.0/dist/chartjs-adapter-date-fns.bundle.min.js"></script>
  <style>
    * { margin: 0; padding: 0; box-sizing: border-box; }
    :root {
      --bg-gradient-start: #4f46e5;
      --bg-gradient-mid: #7c3aed;
      --bg-gradient-end: #2563eb;
      --card-bg: rgba(255, 255, 255, 0.95);
      --card-shadow: 0 20px 60px rgba(0, 0, 0, 0.15);
      --card-hover-shadow: 0 25px 70px rgba(0, 0, 0, 0.2);
      --text-primary: #1f2937;
      --text-secondary: #6b7280;
      --text-muted: #9ca3af;
      --border-color: rgba(229, 231, 235, 0.8);
      --input-bg: #ffffff;
      --input-focus-border: #4f46e5;
      --status-bg: #f9fafb;
      --accent-gradient: linear-gradient(135deg, #4f46e5 0%, #7c3aed 100%);
      --success-color: #10b981;
      --warning-color: #f59e0b;
      --error-color: #ef4444;
      --glass-bg: rgba(255, 255, 255, 0.1);
      --glass-border: rgba(255, 255, 255, 0.2);
    }
    body.dark-mode {
      --bg-gradient-start: #0f172a;
      --bg-gradient-mid: #1e1b4b;
      --bg-gradient-end: #1e293b;
      --card-bg: rgba(30, 41, 59, 0.9);
      --card-shadow: 0 20px 60px rgba(0, 0, 0, 0.4);
      --card-hover-shadow: 0 25px 70px rgba(0, 0, 0, 0.5);
      --text-primary: #f1f5f9;
      --text-secondary: #cbd5e1;
      --text-muted: #94a3b8;
      --border-color: rgba(71, 85, 105, 0.5);
      --input-bg: rgba(15, 23, 42, 0.6);
      --input-focus-border: #818cf8;
      --status-bg: rgba(15, 23, 42, 0.4);
      --glass-bg: rgba(30, 41, 59, 0.2);
      --glass-border: rgba(148, 163, 184, 0.1);
    }
    
    @keyframes fadeInUp {
      from {
        opacity: 0;
        transform: translateY(20px);
      }
      to {
        opacity: 1;
        transform: translateY(0);
      }
    }
    
    @keyframes pulse {
      0%, 100% { opacity: 1; }
      50% { opacity: 0.6; }
    }
    
    @keyframes slideIn {
      from {
        opacity: 0;
        transform: translateX(-20px);
      }
      to {
        opacity: 1;
        transform: translateX(0);
      }
    }
    
    body {
      font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', 'Inter', Roboto, Oxygen, Ubuntu, Cantarell, sans-serif;
      background: linear-gradient(135deg, var(--bg-gradient-start) 0%, var(--bg-gradient-mid) 50%, var(--bg-gradient-end) 100%);
      background-attachment: fixed;
      min-height: 100vh;
      padding: 20px;
      transition: all 0.4s cubic-bezier(0.4, 0, 0.2, 1);
      position: relative;
      overflow-x: hidden;
    }
    
    body::before {
      content: '';
      position: fixed;
      top: 0;
      left: 0;
      right: 0;
      bottom: 0;
      background: radial-gradient(circle at 20% 50%, rgba(99, 102, 241, 0.1) 0%, transparent 50%),
                  radial-gradient(circle at 80% 80%, rgba(168, 85, 247, 0.1) 0%, transparent 50%);
      pointer-events: none;
      z-index: 0;
    }
    .container {
      max-width: 1200px;
      margin: 0 auto;
      position: relative;
      z-index: 1;
    }
    
