fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    .header {
      text-align: center;
      color: white;
      margin-bottom: 40px;
      animation: fadeInUp 0.6s ease-out;
    }
    
    .header h1 {
      font-size: 3em;
      font-weight: 800;
      margin-bottom: 8px;
      text-shadow: 0 4px 20px rgba(0,0,0,0.3);
      letter-spacing: -0.02em;
      color: #ffffff;
    }
    
    .header p {
      font-size: 1.1em;
      opacity: 0.95;
      font-weight: 500;
      letter-spacing: 0.02em;
      text-shadow: 0 2px 10px rgba(0,0,0,0.2);
    }
    
    .theme-toggle {
      position: absolute;
      top: 0;
      right: 0;
      background: var(--glass-bg);
      backdrop-filter: blur(20px);
      -webkit-backdrop-filter: blur(20px);
      border: 1px solid var(--glass-border);
      padding: 12px 20px;
      border-radius: 50px;
      color: white;
      cursor: pointer;
      font-size: 1.3em;
      transition: all 0.3s cubic-bezier(0.4, 0, 0.2, 1);
      box-shadow: 0 8px 24px rgba(0,0,0,0.15);
    }
    
    .theme-toggle:hover {
      transform: translateY(-2px) scale(1.05);
      box-shadow: 0 12px 32px rgba(0,0,0,0.2);
      background: var(--glass-border);
    }
    .nav {
      display: flex;
      gap: 12px;
      justify-content: center;
      margin-bottom: 30px;
      flex-wrap: wrap;
      animation: fadeInUp 0.6s ease-out 0.1s both;
    }
    
    .nav button {
      background: var(--glass-bg);
      backdrop-filter: blur(20px);
      -webkit-backdrop-filter: blur(20px);
      border: 1px solid var(--glass-border);
      color: white;
      padding: 14px 28px;
      border-radius: 12px;
      cursor: pointer;
      font-size: 0.95em;
      font-weight: 600;
      transition: all 0.3s cubic-bezier(0.4, 0, 0.2, 1);
      box-shadow: 0 4px 16px rgba(0,0,0,0.1);
      letter-spacing: 0.02em;
    }
    
    .nav button:hover {
      transform: translateY(-3px);
      box-shadow: 0 8px 24px rgba(0,0,0,0.2);
      background: var(--glass-border);
    }
    
    .nav button.active {
      background: linear-gradient(135deg, rgba(255,255,255,0.95) 0%, rgba(255,255,255,0.9) 100%);
      color: #4f46e5;
      box-shadow: 0 8px 28px rgba(79, 70, 229, 0.3);
      border-color: rgba(255,255,255,0.3);
    }
    
    .card {
      background: var(--card-bg);
      backdrop-filter: blur(20px);
      -webkit-backdrop-filter: blur(20px);
      border-radius: 20px;
      padding: 30px;
      margin-bottom: 24px;
      box-shadow: var(--card-shadow);
      border: 1px solid var(--glass-border);
      transition: all 0.4s cubic-bezier(0.4, 0, 0.2, 1);
      animation: fadeInUp 0.6s ease-out both;
    }
    
    .card:hover {
      box-shadow: var(--card-hover-shadow);
      transform: translateY(-4px);
    }
    
    .card h2 {
      color: var(--text-primary);
      font-size: 1.75em;
      font-weight: 700;
      margin-bottom: 20px;
      letter-spacing: -0.02em;
    }
    
    .card h3 {
      color: var(--text-primary);
      font-size: 1.3em;
      font-weight: 600;
      margin-bottom: 15px;
      margin-top: 25px;
    }
    .value-display {
      text-align: center;
      padding: 50px 40px;
      background: var(--accent-gradient);
      border-radius: 16px;
      color: white;
      box-shadow: 0 16px 48px rgba(79, 70, 229, 0.4);
      position: relative;
      overflow: hidden;
    }
    
    .value-display::before {
      content: '';
      position: absolute;
      top: -50%;
      left: -50%;
      width: 200%;
      height: 200%;
      background: radial-gradient(circle, rgba(255,255,255,0.1) 0%, transparent 70%);
      animation: pulse 3s ease-in-out infinite;
    }
    
    .value-display .label {
      font-size: 1.3em;
      opacity: 0.95;
      margin-bottom: 12px;
      font-weight: 600;
      letter-spacing: 0.05em;
      text-transform: uppercase;
      position: relative;
      z-index: 1;
    }
    
    .value-display .value {
      font-size: 4em;
      font-weight: 800;
      text-shadow: 0 4px 20px rgba(0,0,0,0.2);
      letter-spacing: -0.02em;
      position: relative;
      z-index: 1;
      line-height: 1;
    }
    .status-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(220px, 1fr));
      gap: 16px;
      margin-top: 24px;
    }
    
    .status-item {
      padding: 20px;
      background: var(--status-bg);
      border-radius: 12px;
      border-left: 4px solid var(--input-focus-border);
      transition: all 0.3s cubic-bezier(0.4, 0, 0.2, 1);
      position: relative;
      overflow: hidden;
    }
    
    .status-item::before {
      content: '';
      position: absolute;
      top: 0;
      left: -100%;
      width: 100%;
      height: 100%;
      background: linear-gradient(90deg, transparent, rgba(79, 70, 229, 0.05), transparent);
      transition: left 0.5s ease;
    }
    
    .status-item:hover {
      transform: translateX(4px);
      box-shadow: 0 8px 24px rgba(0,0,0,0.08);
    }
    
    .status-item:hover::before {
      left: 100%;
    }
    
    .status-item .label {
      font-size: 0.85em;
      color: var(--text-secondary);
      margin-bottom: 8px;
      font-weight: 600;
      text-transform: uppercase;
      letter-spacing: 0.05em;
    }
    
    .status-item .value {
      font-size: 1.4em;
      font-weight: 700;
      color: var(--text-primary);
      letter-spacing: -0.01em;
    }
    
    .status-online { 
      border-left-color: var(--success-color);
      background: linear-gradient(135deg, rgba(16, 185, 129, 0.05) 0%, var(--status-bg) 100%);
    }
    .status-offline { 
      border-left-color: var(--error-color);
      background: linear-gradient(135deg, rgba(239, 68, 68, 0.05) 0%, var(--status-bg) 100%);
    }
    .chart-container {
      height: 300px;
      margin-top: 20px;
      position: relative;
      cursor: crosshair;
    }
    .chart {
      width: 100%;
      height: 100%;
      touch-action: pan-x pinch-zoom;
    }
    .chart-tooltip {
      position: absolute;
      background: rgba(0,0,0,0.8);
      color: white;
      padding: 8px 12px;
      border-radius: 6px;
      font-size: 0.85em;
      pointer-events: none;
      display: none;
      z-index: 1000;
      white-space: nowrap;
    }
    .form-group {
      margin-bottom: 24px;
    }
    
    .form-group label {
      display: block;
      margin-bottom: 8px;
      font-weight: 600;
      color: var(--text-primary);
      font-size: 0.95em;
      letter-spacing: 0.01em;
    }
    
    .form-group input, .form-group select {
      width: 100%;
      padding: 14px 16px;
      border: 2px solid var(--border-color);
      border-radius: 10px;
      font-size: 1em;
      background: var(--input-bg);
      color: var(--text-primary);
      transition: all 0.3s cubic-bezier(0.4, 0, 0.2, 1);
      font-family: inherit;
    }
    
    .form-group input:focus, .form-group select:focus {
      outline: none;
      border-color: var(--input-focus-border);
      box-shadow: 0 0 0 4px rgba(79, 70, 229, 0.1);
      transform: translateY(-1px);
    }
    
    .form-group small {
      display: block;
      margin-top: 6px;
      color: var(--text-secondary);
      font-size: 0.85em;
      line-height: 1.4;
    }
    
    .btn {
      background: var(--accent-gradient);
      color: white;
      border: none;
      padding: 14px 32px;
      border-radius: 10px;
      font-size: 1em;
      font-weight: 600;
      cursor: pointer;
      transition: all 0.3s cubic-bezier(0.4, 0, 0.2, 1);
      box-shadow: 0 6px 20px rgba(79, 70, 229, 0.3);
      letter-spacing: 0.02em;
    }
    
    .btn:hover {
      transform: translateY(-2px);
      box-shadow: 0 10px 30px rgba(79, 70, 229, 0.4);
    }
    
    .btn:active {
      transform: translateY(0);
      box-shadow: 0 4px 15px rgba(79, 70, 229, 0.3);
    }
    
    .alert {
      padding: 16px 20px;
      border-radius: 12px;
      margin-bottom: 20px;
      display: none;
      font-weight: 500;
      border-left: 4px solid;
      animation: slideIn 0.3s ease-out;
    }
    
