fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    .alert.success {
      background: rgba(16, 185, 129, 0.1);
      color: var(--success-color);
      border-color: var(--success-color);
    }
    
    .alert.error {
      background: rgba(239, 68, 68, 0.1);
      color: var(--error-color);
      border-color: var(--error-color);
    }
    
    .chart-container {
      height: 350px;
      margin-top: 24px;
      position: relative;
      cursor: crosshair;
      border-radius: 12px;
      overflow: hidden;
    }
    
    .chart {
      width: 100%;
      height: 100%;
      touch-action: pan-x pinch-zoom;
    }
    
    .chart-tooltip {
      position: absolute;
      background: rgba(15, 23, 42, 0.95);
      backdrop-filter: blur(10px);
      color: white;
      padding: 10px 14px;
      border-radius: 8px;
      font-size: 0.9em;
      pointer-events: none;
      display: none;
      z-index: 1000;
      white-space: nowrap;
      box-shadow: 0 8px 24px rgba(0,0,0,0.3);
      border: 1px solid rgba(255,255,255,0.1);
    }
    
    .page {
      display: none;
    }
    
    .page.active {
      display: block;
      animation: fadeInUp 0.4s ease-out;
    }
    
    @media (max-width: 768px) {
      .header h1 { font-size: 2.2em; }
      .value-display .value { font-size: 2.8em; }
      .value-display { padding: 40px 30px; }
      .nav { gap: 8px; }
      .nav button { padding: 12px 20px; font-size: 0.9em; }
      .card { padding: 20px; }
      .status-grid { grid-template-columns: 1fr; }
    }
    
    @media (max-width: 480px) {
      body { padding: 12px; }
      .header h1 { font-size: 1.8em; }
      .value-display .value { font-size: 2.2em; }
      .card h2 { font-size: 1.4em; }
    }
  </style>
</head>
<body>
  <div class="container">
    <div class="header">
      <h1>⚡ Gaszähler Monitor</h1>
      <p>ESP32 M-Bus Gateway v%VERSION%</p>
      <div id="apModeWarning" style="display: none; background: #ff9800; color: white; padding: 10px; border-radius: 8px; margin-top: 10px;">
        ⚠️ <strong>Access Point Modus aktiv!</strong><br>
        Bitte konfigurieren Sie WLAN unter "Konfiguration" und speichern Sie die Einstellungen.
      </div>
    </div>

    <div class="nav">
      <button onclick="showPage('dashboard')" class="active" id="navDashboard">&#128200; Dashboard</button>
      <button onclick="showPage('config')" id="navConfig">&#9881; Konfiguration</button>
      <button onclick="showPage('logs')" id="navLogs">&#128221; Live Logs</button>
      <button onclick="showPage('diagnostics')" id="navDiagnostics">&#128295; Diagnose</button>
      <button onclick="showPage('update')" id="navUpdate">&#11014; Firmware Update</button>
    </div>

    <div id="dashboard" class="page active">
      <div class="card">
        <div class="value-display">
          <div class="label">&#128267; Aktueller Zählerstand</div>
          <div class="value" id="gasValue">-- m&sup3;</div>
          <div style="margin-top: 15px; font-size: 1em; opacity: 0.95; font-weight: 600;" id="energyValue">&#9889; -- kWh</div>
          <div style="margin-top: 20px; padding-top: 15px; border-top: 1px solid rgba(255,255,255,0.2); font-size: 0.85em; opacity: 0.9; display: flex; justify-content: center; gap: 20px;">
            <span>&#128293; Brennwert: <strong id="calorificDisplay">--</strong> kWh/m³</span>
            <span>&#9881; Zustandszahl: <strong id="correctionDisplay">--</strong></span>
          </div>
        </div>
      </div>

      <div class="card">
        <h2>&#128202; System Status</h2>
        <div class="status-grid">
          <div class="status-item" id="wifiStatus">
            <div class="label">&#128246; WLAN</div>
            <div class="value">--</div>
          </div>
          <div class="status-item" id="mqttStatus">
            <div class="label">&#128228; MQTT</div>
            <div class="value">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#9201; Uptime</div>
            <div class="value" id="uptime">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#128336; Letzte Messung</div>
            <div class="value" id="lastUpdate">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#128337; Poll-Intervall</div>
            <div class="value" id="pollInterval">--</div>
          </div>
          <div class="status-item" id="wifiSignal">
            <div class="label">&#128246; WLAN Signal</div>
            <div class="value">--</div>
          </div>
        </div>
      </div>

      <div class="card">
        <h2>📊 M-Bus Statistik</h2>
        <div class="status-grid">
          <div class="status-item">
            <div class="label">✅ Erfolgsrate</div>
            <div class="value" id="mbusSuccessRate">--%</div>
          </div>
          <div class="status-item">
            <div class="label">📡 Abfragen Gesamt</div>
            <div class="value" id="mbusTotal">0</div>
          </div>
          <div class="status-item">
            <div class="label">⏱ Ø Antwortzeit</div>
            <div class="value" id="mbusAvgTime">-- ms</div>
          </div>
          <div class="status-item">
            <div class="label">⚡ Letzte Antwort</div>
            <div class="value" id="mbusLastTime">-- ms</div>
          </div>
        </div>
      </div>

      <div class="card">
        <h2 style="margin-bottom: 20px;">📈 Verlauf & Statistik</h2>
        
        <!-- Verbrauchsstatistik -->
        <div style="display: grid; grid-template-columns: repeat(auto-fit, minmax(150px, 1fr)); gap: 12px; margin-bottom: 20px;">
          <div style="background: linear-gradient(135deg, rgba(16, 185, 129, 0.1) 0%, rgba(5, 150, 105, 0.1) 100%); border: 1px solid rgba(16, 185, 129, 0.3); border-radius: 10px; padding: 12px; text-align: center;">
            <div style="color: var(--text-muted); font-size: 0.85em; margin-bottom: 4px;">📅 Heute</div>
            <div style="color: #10b981; font-size: 1.3em; font-weight: bold;" id="statToday">-- m³</div>
            <div style="color: var(--text-muted); font-size: 0.75em;" id="statTodayKwh">-- kWh</div>
          </div>
          <div style="background: linear-gradient(135deg, rgba(59, 130, 246, 0.1) 0%, rgba(37, 99, 235, 0.1) 100%); border: 1px solid rgba(59, 130, 246, 0.3); border-radius: 10px; padding: 12px; text-align: center;">
            <div style="color: var(--text-muted); font-size: 0.85em; margin-bottom: 4px;">📆 Diese Woche</div>
            <div style="color: #3b82f6; font-size: 1.3em; font-weight: bold;" id="statWeek">-- m³</div>
            <div style="color: var(--text-muted); font-size: 0.75em;" id="statWeekKwh">-- kWh</div>
          </div>
          <div style="background: linear-gradient(135deg, rgba(139, 92, 246, 0.1) 0%, rgba(124, 58, 237, 0.1) 100%); border: 1px solid rgba(139, 92, 246, 0.3); border-radius: 10px; padding: 12px; text-align: center;">
            <div style="color: var(--text-muted); font-size: 0.85em; margin-bottom: 4px;">📅 Dieser Monat</div>
            <div style="color: #8b5cf6; font-size: 1.3em; font-weight: bold;" id="statMonth">-- m³</div>
            <div style="color: var(--text-muted); font-size: 0.75em;" id="statMonthKwh">-- kWh</div>
          </div>
          <div style="background: linear-gradient(135deg, rgba(251, 191, 36, 0.1) 0%, rgba(245, 158, 11, 0.1) 100%); border: 1px solid rgba(251, 191, 36, 0.3); border-radius: 10px; padding: 12px; text-align: center;">
            <div style="color: var(--text-muted); font-size: 0.85em; margin-bottom: 4px;">📊 Ø pro Tag</div>
            <div style="color: #fbbf24; font-size: 1.3em; font-weight: bold;" id="statAvg">-- m³</div>
            <div style="color: var(--text-muted); font-size: 0.75em;" id="statAvgKwh">-- kWh</div>
          </div>
        </div>
        
        <div class="chart-container" id="chartContainer">
          <canvas id="chart" class="chart"></canvas>
          <div id="chartTooltip" class="chart-tooltip"></div>
        </div>
      </div>
    </div>

    <div id="config" class="page">
      <div class="card">
        <h2>&#9881; Einstellungen</h2>
        <div id="configAlert" class="alert"></div>
        <form id="configForm" onsubmit="saveConfig(event)">
          <h3>&#128246; WLAN</h3>
          <div class="form-group">
            <label>SSID</label>
            <div style="display: flex; gap: 10px; align-items: start;">
              <input type="text" id="ssid" name="ssid" required style="flex: 1;" placeholder="Netzwerkname">
              <button type="button" onclick="scanWifi()" class="btn" style="padding: 12px 24px; white-space: nowrap;">&#128246; Scannen</button>
            </div>
            <select id="wifiList" onchange="selectWifi()" style="width: 100%; padding: 12px; border: 2px solid var(--border-color); border-radius: 10px; margin-top: 10px; display: none; background: var(--input-bg); color: var(--text-primary);">
              <option value="">-- Netzwerk auswhlen --</option>
            </select>
          </div>
          <div class="form-group">
            <label>Passwort</label>
            <div style="position: relative;">
              <input type="password" id="password" name="password" style="padding-right: 45px;">
              <button type="button" id="togglePassword" onclick="togglePasswordVisibility('password', 'togglePassword')" style="position: absolute; right: 10px; top: 50%; transform: translateY(-50%); background: none; border: none; cursor: pointer; font-size: 1.1em; color: var(--text-secondary); padding: 4px;">&#9680;</button>
            </div>
          </div>
          <div class="form-group">
            <label>Hostname</label>
            <input type="text" id="hostname" name="hostname" required>
            <small style="color: var(--text-secondary);">Für mDNS (z.B. ESP32-GasZaehler.local)</small>
          </div>
          
          <h3 style="margin-top: 30px;">Netzwerk-Einstellungen</h3>
          <div class="form-group">
            <label>
              <input type="checkbox" id="use_static_ip" name="use_static_ip" style="width: auto; margin-right: 10px;">
              Static IP verwenden (statt DHCP)
            </label>
          </div>
          <div id="staticIpFields" style="display: none;">
            <div class="form-group">
              <label>IP-Adresse</label>
              <input type="text" id="static_ip" name="static_ip" placeholder="192.168.1.100">
            </div>
            <div class="form-group">
              <label>Gateway</label>
              <input type="text" id="static_gateway" name="static_gateway" placeholder="192.168.1.1">
            </div>
            <div class="form-group">
              <label>Subnet Mask</label>
              <input type="text" id="static_subnet" name="static_subnet" placeholder="255.255.255.0">
            </div>
            <div class="form-group">
              <label>DNS Server</label>
              <input type="text" id="static_dns" name="static_dns" placeholder="192.168.1.1">
            </div>
          </div>
          
