fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
          <h3 style="margin-top: 30px;">MQTT</h3>
          <div class="form-group">
            <label>Server IP</label>
            <input type="text" id="mqtt_server" name="mqtt_server" required>
          </div>
          <div class="form-group">
            <label>Port</label>
            <input type="number" id="mqtt_port" name="mqtt_port" required>
          </div>
          <div class="form-group">
            <label>Benutzername (optional)</label>
            <input type="text" id="mqtt_user" name="mqtt_user">
            <small style="color: var(--text-secondary);">Leer lassen wenn keine Authentifizierung</small>
          </div>
          <div class="form-group">
            <label>Passwort (optional)</label>
            <div style="position: relative;">
              <input type="password" id="mqtt_pass" name="mqtt_pass" style="padding-right: 45px;">
              <button type="button" id="toggleMqttPass" onclick="togglePasswordVisibility('mqtt_pass', 'toggleMqttPass')" style="position: absolute; right: 10px; top: 50%; transform: translateY(-50%); background: none; border: none; cursor: pointer; font-size: 1.1em; color: var(--text-secondary); padding: 4px;">&#9680;</button>
            </div>
          </div>
          <div class="form-group">
            <label>Topic</label>
            <input type="text" id="mqtt_topic" name="mqtt_topic" required>
          </div>
          
          <h3 style="margin-top: 30px;">Abfrage-Einstellungen</h3>
          <div class="form-group">
            <label>Poll-Intervall (Sekunden)</label>
            <input type="number" id="poll_interval" name="poll_interval" min="10" max="300" required>
            <small style="color: #666;">Wie oft der Gaszähler abgefragt wird (10-300 Sekunden)</small>
          </div>
          
          <h3 style="margin-top: 30px;">Energie-Umrechnung (für Home Assistant Energy Dashboard)</h3>
          <div class="form-group">
            <label>Brennwert (kWh/m³)</label>
            <input type="number" id="gas_calorific" name="gas_calorific" step="0.000001" min="8" max="13" required>
            <small style="color: var(--text-muted);">Brennwert von Erdgas (typisch 10.0-10.5 kWh/m³, siehe Gasrechnung)</small>
          </div>
          <div class="form-group">
            <label>Korrekturfaktor (Z-Zahl)</label>
            <input type="number" id="gas_correction" name="gas_correction" step="0.000001" min="0.90" max="1.10" required>
            <small style="color: var(--text-muted);">Zustandszahl für Druck/Temperatur (typisch 0.95-0.97, siehe Gasrechnung)</small>
          </div>
          
          <button type="submit" class="btn" style="width: 100%; padding: 16px; font-size: 1.05em; margin-top: 10px;">&#128190; Speichern & Neustart</button>
        </form>
      </div>
    </div>

    <div id="logs" class="page">
      <div class="card">
        <h2>&#128221; Live Logs</h2>
        <div style="display: flex; justify-content: space-between; align-items: center; margin-bottom: 20px; flex-wrap: wrap; gap: 10px;">
          <span style="color: var(--text-secondary); font-size: 0.95em;">&#128220; Zeigt die letzten 50 Log-Eintrage</span>
          <button onclick="refreshLogs()" class="btn" style="padding: 10px 20px;">&#128260; Aktualisieren</button>
        </div>
        <div id="logContainer" style="background: var(--status-bg); border-radius: 12px; padding: 20px; max-height: 600px; overflow-y: auto; font-family: 'Consolas', 'Monaco', monospace; font-size: 0.9em; line-height: 1.6; border: 1px solid var(--border-color); color: var(--text-primary);">
          <div style="text-align: center; color: var(--text-secondary); padding: 20px;">&#128260; Keine Logs vorhanden</div>
        </div>
      </div>
    </div>

    <div id="diagnostics" class="page">
      <div class="card">
        <div style="display: flex; justify-content: space-between; align-items: center; margin-bottom: 15px;">
          <h2 style="margin: 0;">⚠ Fehlerstatistik</h2>
          <button onclick="resetErrorStats()" class="btn" style="padding: 8px 16px; font-size: 0.9em; background: var(--warning-color);">🗑 Zurücksetzen</button>
        </div>
        <div class="status-grid">
          <div class="status-item">
            <div class="label">M-Bus Timeouts</div>
            <div class="value" id="errMbusTimeout">0</div>
          </div>
          <div class="status-item">
            <div class="label">M-Bus Parse-Fehler</div>
            <div class="value" id="errMbusParse">0</div>
          </div>
          <div class="status-item">
            <div class="label">MQTT Fehler</div>
            <div class="value" id="errMqtt">0</div>
          </div>
          <div class="status-item">
            <div class="label">WLAN Trennungen</div>
            <div class="value" id="errWifi">0</div>
          </div>
        </div>
        <div id="lastError" style="margin-top: 15px; padding: 15px; background: var(--status-bg); border-radius: 10px; border-left: 4px solid var(--error-color); display: none;">
          <strong style="color: var(--text-primary);">&#128681; Letzter Fehler:</strong> <span id="lastErrorMsg" style="color: var(--text-secondary); margin-left: 8px;">--</span>
        </div>
      </div>

      <div class="card">
        <h2>&#128187; System-Informationen</h2>
        <div class="status-grid">
          <div class="status-item">
            <div class="label">&#128190; Freier Heap</div>
            <div class="value" id="freeHeap">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#128190; Heap-Größe</div>
            <div class="value" id="heapSize">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#128191; Flash-Größe</div>
            <div class="value" id="flashSize">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#128191; Sketch-Größe</div>
            <div class="value" id="sketchSize">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#128191; Freier Flash</div>
            <div class="value" id="freeFlash">--</div>
          </div>
          <div class="status-item">
            <div class="label">&#9889; Chip-Modell</div>
            <div class="value" id="chipModel">--</div>
          </div>
        </div>
      </div>

      <div class="card">
        <h2>&#128295; Netzwerk-Diagnose</h2>
        <div style="display: grid; grid-template-columns: repeat(auto-fit, minmax(250px, 1fr)); gap: 15px; margin-top: 24px;">
          <button onclick="testMQTT()" class="btn" style="padding: 18px; font-size: 1em;">&#128228; MQTT Verbindung testen</button>
          <button onclick="testWiFi()" class="btn" style="padding: 18px; font-size: 1em;">&#128246; WiFi Signal prüfen</button>
          <button onclick="pingGateway()" class="btn" style="padding: 18px; font-size: 1em;">&#127759; Gateway Ping</button>
          <button onclick="exportData()" class="btn" style="padding: 18px; font-size: 1em;">&#128190; Daten als CSV</button>
        </div>
        <div id="diagResult" style="margin-top: 24px; padding: 20px; background: var(--status-bg); border-radius: 12px; font-family: 'Consolas', 'Monaco', monospace; white-space: pre-wrap; display: none; border: 1px solid var(--border-color); line-height: 1.6;"></div>
      </div>

      <div class="card">
        <h2>&#128268; M-Bus Diagnose</h2>
        <div style="margin-bottom: 20px;">
          <button onclick="refreshMBusData()" class="btn" style="padding: 14px 28px;">&#128260; M-Bus Abfrage starten</button>
        </div>
        <div class="status-grid">
          <div class="status-item">
            <div class="label">Erfolgsquote</div>
            <div class="value" id="mbusSuccessRate">--</div>
          </div>
          <div class="status-item">
            <div class="label"> Antwortzeit</div>
            <div class="value" id="mbusAvgResponse">--</div>
          </div>
          <div class="status-item">
            <div class="label">Letzte Antwort</div>
            <div class="value" id="mbusLastResponse">--</div>
          </div>
          <div class="status-item">
            <div class="label">Gesamt Abfragen</div>
            <div class="value" id="mbusTotalPolls">--</div>
          </div>
        </div>
        <h3 style="margin-top: 20px;">Letzte M-Bus Rohdaten (Hex)</h3>
        <div id="mbusHexDump" style="background: var(--status-bg); border-radius: 8px; padding: 15px; font-family: monospace; font-size: 0.85em; word-break: break-all; color: var(--text-secondary);">Keine Daten vorhanden</div>
      </div>

      <div class="card">
        <h2> Letzte erfolgreiche Messungen</h2>
        <div id="lastMeasurements" style="max-height: 300px; overflow-y: auto;">
          <div style="text-align: center; color: var(--text-muted); padding: 20px;">Lade Daten...</div>
        </div>
      </div>

