fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    </div>

    <div id="update" class="page">
      <div class="card">
        <h2>&#11014; Firmware Update</h2>
        
        <div style="background: linear-gradient(135deg, rgba(99, 102, 241, 0.1) 0%, rgba(168, 85, 247, 0.1) 100%); border: 2px solid #818cf8; border-radius: 12px; padding: 20px; margin-bottom: 24px;">
          <strong style="color: #818cf8; font-size: 1.1em;">&#9889; OTA Update über PlatformIO (empfohlen)</strong>
          <p style="margin: 12px 0; color: var(--text-primary); line-height: 1.6;">
            Der ESP32 unterstützt drahtloses Firmware-Update über das Netzwerk.
          </p>
          
          <div style="background: var(--status-bg); border-radius: 8px; padding: 16px; margin: 16px 0; font-family: 'Courier New', monospace; font-size: 0.9em;">
            <div style="color: var(--text-primary); margin-bottom: 8px; font-weight: 600;">1. In PlatformIO Terminal:</div>
            <code style="color: var(--text-primary); display: block; padding: 8px; background: var(--input-bg); border: 1px solid var(--border-color); border-radius: 4px; margin-bottom: 12px;">
              pio run -t upload --upload-port <span id="currentIP" style="color: #10b981; font-weight: bold;">Lädt...</span>
            </code>
            
            <div style="color: var(--text-primary); margin-bottom: 8px; font-weight: 600;">2. Oder in platformio.ini hinzufügen:</div>
            <code style="color: var(--text-primary); display: block; padding: 8px; background: var(--input-bg); border: 1px solid var(--border-color); border-radius: 4px; white-space: pre;">upload_protocol = espota
upload_port = <span id="currentIP2" style="color: #10b981; font-weight: bold;">Lädt...</span></code>
          </div>
        </div>

        <div style="background: linear-gradient(135deg, rgba(245, 158, 11, 0.1) 0%, rgba(251, 191, 36, 0.1) 100%); border: 2px solid #fbbf24; border-radius: 12px; padding: 20px; margin-bottom: 24px;">
          <strong style="color: #fbbf24; font-size: 1.1em;">&#9888; Alternative: USB-Upload</strong>
          <p style="margin: 12px 0 0 0; color: var(--text-primary); line-height: 1.6;">
            Bei Problemen mit OTA: ESP32 per USB verbinden und mit <code style="background: var(--status-bg); color: var(--text-primary); padding: 2px 6px; border-radius: 4px;">pio run -t upload</code> flashen.
          </p>
        </div>

        <div style="background: linear-gradient(135deg, rgba(99, 102, 241, 0.15) 0%, rgba(168, 85, 247, 0.15) 100%); border: 1px solid #818cf8; border-radius: 12px; padding: 20px; margin-top: 20px;">
          <div style="color: var(--text-primary); margin-bottom: 12px;"><strong style="color: #818cf8; font-size: 1.1em;">&#128218; Aktuell:</strong></div>
          <div style="color: var(--text-primary); line-height: 1.8;">
            <div style="margin-bottom: 8px;">Version: <code style="background: rgba(99, 102, 241, 0.2); color: #818cf8; padding: 4px 10px; border-radius: 6px; font-weight: bold;">2.0.1</code></div>
            <div style="margin-bottom: 8px;">IP-Adresse: <code id="currentIP3" style="background: rgba(16, 185, 129, 0.2); color: #10b981; padding: 4px 10px; border-radius: 6px; font-weight: bold;">Lädt...</code></div>
            <div>Hostname: <code style="background: rgba(99, 102, 241, 0.2); color: #818cf8; padding: 4px 10px; border-radius: 6px; font-weight: bold;">esp32-gas.local</code></div>
          </div>
        </div>
      </div>
    </div>
  </div>

  <script>
    let currentPage = 'dashboard';
    let updateInterval = null;
    let fullHistoryData = [];

    // Dark Mode initialisieren
    function initDarkMode() {
      const darkMode = localStorage.getItem('darkMode') !== 'false'; // Default: true
      if (darkMode) {
        document.body.classList.add('dark-mode');
        document.getElementById('themeToggle').textContent = '';
        localStorage.setItem('darkMode', 'true');
      } else {
        document.getElementById('themeToggle').textContent = '';
      }
    }

    function toggleDarkMode() {
      const isDark = document.body.classList.toggle('dark-mode');
      localStorage.setItem('darkMode', isDark);
      document.getElementById('themeToggle').textContent = isDark ? '' : '';
      
      // Chart neu zeichnen fr Theme-Anpassung
      if (currentPage === 'dashboard' && fullHistoryData.length > 0) {
        drawChart(fullHistoryData);
      }
    }

    function togglePasswordVisibility(fieldId, buttonId) {
      const field = document.getElementById(fieldId);
      const button = document.getElementById(buttonId);
      if (field.type === 'password') {
        field.type = 'text';
        button.textContent = '\u25CB'; // Open circle
      } else {
        field.type = 'password';
        button.textContent = '\u25C0'; // Filled circle
      }
    }

    function showPage(page) {
      document.querySelectorAll('.page').forEach(p => p.classList.remove('active'));
      document.querySelectorAll('.nav button').forEach(b => b.classList.remove('active'));
      document.getElementById(page).classList.add('active');
      document.getElementById('nav' + page.charAt(0).toUpperCase() + page.slice(1)).classList.add('active');
      currentPage = page;
      
      if (page === 'dashboard') {
        if (updateInterval) clearInterval(updateInterval);
        updateData();
      } else {
        if (updateInterval) clearInterval(updateInterval);
        if (page === 'config') loadConfig();
        if (page === 'logs') {
          refreshLogs();
          updateInterval = setInterval(refreshLogs, 3000);
        }
        if (page === 'diagnostics') {
          refreshMBusData();
          fetch('/api/data').then(r => r.json()).then(data => {
            if (data.history && data.history.length > 0) {
              let html = '<div style="display: grid; gap: 10px;">';
              data.history.slice(-10).reverse().forEach(point => {
                const date = new Date(point.timestamp * 1000);
                const energy = (point.volume * data.calorific * data.correction).toFixed(3);
                html += `<div style="padding: 10px; background: var(--status-bg); border-radius: 5px; display: flex; justify-content: space-between;">`;
                html += `<span style="color: var(--text-secondary);">${date.toLocaleString('de-DE')}</span>`;
                html += `<strong style="color: var(--text-primary);">${point.volume.toFixed(2)} m³ / ${energy} kWh</strong>`;
                html += `</div>`;
              });
              html += '</div>';
              const el = document.getElementById('lastMeasurements');
              if (el) el.innerHTML = html;
            }
          });
        }
      }
    }

    function updateData() {
      fetch('/api/data')
        .then(r => r.json())
        .then(data => {
          const el = (id) => document.getElementById(id);
          
          // AP-Modus Warnung anzeigen
          if (data.apMode && el('apModeWarning')) {
            el('apModeWarning').style.display = 'block';
          }
          
          if (el('gasValue')) {
            el('gasValue').textContent = data.volume >= 0 ? data.volume.toFixed(2) + ' m³' : '-- m³';
          }
          
          // Energie-Anzeige
          if (el('energyValue')) {
            if (data.volume >= 0 && data.calorific > 0) {
              const energy = (data.volume * data.calorific * data.correction).toFixed(3);
              el('energyValue').textContent = '⚡ ' + energy + ' kWh';
            } else {
              el('energyValue').textContent = '⚡ -- kWh';
            }
          }
          
