fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
          // Brennwert & Zustandszahl anzeigen
          if (el('calorificDisplay')) {
            el('calorificDisplay').textContent = data.calorific > 0 ? data.calorific.toFixed(6) : '--';
          }
          if (el('correctionDisplay')) {
            el('correctionDisplay').textContent = data.correction > 0 ? data.correction.toFixed(6) : '--';
          }
          
          const wifiDiv = document.getElementById('wifiStatus');
          if (wifiDiv) {
            const valueEl = wifiDiv.querySelector('.value');
            if (valueEl) {
              if (data.apMode) {
                valueEl.textContent = 'AP-Modus (' + data.apSSID + ')';
                wifiDiv.className = 'status-item';
                wifiDiv.style.borderLeftColor = '#ff9800';
              } else {
                valueEl.textContent = data.wifiConnected ? 'Verbunden' : 'Getrennt';
                wifiDiv.className = data.wifiConnected ? 'status-item status-online' : 'status-item status-offline';
              }
            }
          }
          
          // WiFi Signal Strength
          const signalDiv = document.getElementById('wifiSignal');
          if (signalDiv) {
            const valueEl = signalDiv.querySelector('.value');
            if (valueEl) {
              if (data.wifiConnected && !data.apMode) {
                const rssi = data.wifiRSSI;
                let quality = 'Schlecht';
                let color = '#dc3545';
                let bars = '';
                
                if (rssi >= -50) {
                  quality = 'Ausgezeichnet';
                  color = '#28a745';
                  bars = '';
                } else if (rssi >= -60) {
                  quality = 'Gut';
                  color = '#28a745';
                  bars = '';
                } else if (rssi >= -70) {
                  quality = 'Mittel';
                  color = '#ffc107';
                  bars = '';
                } else if (rssi >= -80) {
                  quality = 'Schwach';
                  color = '#ff9800';
                  bars = '';
                }
                
                valueEl.textContent = bars + ' ' + rssi + ' dBm (' + quality + ')';
                signalDiv.style.borderLeftColor = color;
              } else {
                valueEl.textContent = '--';
                signalDiv.style.borderLeftColor = '#667eea';
              }
            }
          }
          
          const mqttDiv = document.getElementById('mqttStatus');
          if (mqttDiv) {
            const valueEl = mqttDiv.querySelector('.value');
            if (valueEl) {
              valueEl.textContent = data.mqttConnected ? 'Verbunden' : 'Getrennt';
              mqttDiv.className = data.mqttConnected ? 'status-item status-online' : 'status-item status-offline';
            }
          }
          
          if (el('uptime')) el('uptime').textContent = formatUptime(data.uptime);
          
          // Zeitstempel-Anzeige (NTP oder relative Zeit)
          if (el('lastUpdate')) {
            if (data.timeInitialized && data.lastUpdate > 1000000000) {
              const date = new Date(data.lastUpdate * 1000);
              el('lastUpdate').textContent = date.toLocaleTimeString('de-DE');
            } else {
              el('lastUpdate').textContent = 
                data.lastUpdate > 0 ? Math.floor((data.uptime - data.lastUpdate) / 1000) + 's' : '--';
            }
          }
          
          if (el('pollInterval')) el('pollInterval').textContent = data.pollInterval + 's';
          
          // IP-Adresse in Update-Seite eintragen
          const ipAddress = data.ipAddress || window.location.hostname || '10.10.40.109';
          const ipElements = ['currentIP', 'currentIP2', 'currentIP3'];
          ipElements.forEach(id => {
            const el = document.getElementById(id);
            if (el) el.textContent = ipAddress;
          });
          
          // System Info
          if (data.system) {
            const el = (id) => document.getElementById(id);
            if (el('freeHeap')) el('freeHeap').textContent = (data.system.freeHeap / 1024).toFixed(1) + ' KB';
            if (el('heapSize')) el('heapSize').textContent = (data.system.heapSize / 1024).toFixed(1) + ' KB';
            if (el('flashSize')) el('flashSize').textContent = (data.system.flashSize / 1024 / 1024).toFixed(1) + ' MB';
            if (el('sketchSize')) el('sketchSize').textContent = (data.system.sketchSize / 1024).toFixed(1) + ' KB';
            if (el('freeFlash')) el('freeFlash').textContent = (data.system.freeSketch / 1024).toFixed(1) + ' KB';
            if (el('chipModel')) el('chipModel').textContent = data.system.chipModel + ' (' + data.system.chipCores + ' Cores @ ' + data.system.cpuFreq + 'MHz)';
          }
          
          // M-Bus Statistiken (von /api/diagnostics)
          fetch('/api/diagnostics')
            .then(r => r.json())
            .then(mbusData => {
              if (mbusData.mbus) {
                const successRate = mbusData.mbus.total > 0 ? 
                  ((mbusData.mbus.successful / mbusData.mbus.total) * 100).toFixed(1) : '0.0';
                const el = (id) => document.getElementById(id);
                if (el('mbusSuccessRate')) el('mbusSuccessRate').textContent = successRate + '%';
                if (el('mbusTotal')) el('mbusTotal').textContent = mbusData.mbus.total;
                if (el('mbusAvgTime')) el('mbusAvgTime').textContent = 
                  mbusData.mbus.avgResponseTime > 0 ? mbusData.mbus.avgResponseTime + ' ms' : '-- ms';
                if (el('mbusLastTime')) el('mbusLastTime').textContent = 
                  mbusData.mbus.lastResponseTime > 0 ? mbusData.mbus.lastResponseTime + ' ms' : '-- ms';
              }
            })
            .catch(e => console.log('M-Bus Stats nicht verfügbar'));
          
          // Error Stats
          if (data.errors) {
            const el = (id) => document.getElementById(id);
            if (el('errMbusTimeout')) el('errMbusTimeout').textContent = data.errors.mbusTimeouts || 0;
            if (el('errMbusParse')) el('errMbusParse').textContent = data.errors.mbusParseErrors || 0;
            if (el('errMqtt')) el('errMqtt').textContent = data.errors.mqttErrors || 0;
            if (el('errWifi')) el('errWifi').textContent = data.errors.wifiDisconnects || 0;
          }
          
          // Letzter Fehler nur anzeigen wenn:
          // 1. Es einen Fehler gibt UND
          // 2. Der Fehler nicht älter als 2 Minuten ist UND
          // 3. System aktuell NICHT verbunden ist (sonst ist Fehler behoben)
          if (data.errors) {
            const totalErrors = (data.errors.mbusTimeouts || 0) + (data.errors.mbusParseErrors || 0) + 
                               (data.errors.mqttErrors || 0) + (data.errors.wifiDisconnects || 0);
            const errorAge = data.uptime - (data.errors.lastErrorTime || 0);
            const twoMinutes = 2 * 60 * 1000;
            const hasActiveIssue = !data.wifiConnected || !data.mqttConnected;
            
            const lastErrorEl = document.getElementById('lastError');
            if (lastErrorEl) {
              if (data.errors.lastError && totalErrors > 0 && errorAge < twoMinutes && hasActiveIssue) {
                lastErrorEl.style.display = 'block';
                const ageText = errorAge < 60000 ? 
                  'vor ' + Math.floor(errorAge / 1000) + 's' : 
                  'vor ' + Math.floor(errorAge / 60000) + 'min';
                const lastErrorMsg = document.getElementById('lastErrorMsg');
                if (lastErrorMsg) lastErrorMsg.textContent = data.errors.lastError + ' (' + ageText + ')';
              } else {
                lastErrorEl.style.display = 'none';
              }
            }
          }
          
