fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
          if (data.history && data.history.length > 0) {
            // Normalize timestamps: some stored timestamps may be in ms (old devices)
            // JS expects seconds. Detect and convert if needed.
            const nowMs = Date.now();
            let hist = data.history.map(p => ({ timestamp: p.timestamp, volume: p.volume }));
            const seemsMs = hist.some(p => p.timestamp > nowMs + 1000);
            if (seemsMs) {
              hist = hist.map(p => ({ timestamp: Math.floor(p.timestamp / 1000), volume: p.volume }));
            }
            fullHistoryData = hist;
            updateConsumptionStats(hist, data.calorific, data.correction);
            drawChart(hist);
          }
        })
        .catch(e => {
          console.error('API Fehler beim Laden der Daten:', e);
          // Zeige Fehler auf der Seite an
          const elements = ['wifiStatus', 'mqttStatus', 'gasValue'];
          elements.forEach(id => {
            const el = document.getElementById(id);
            if (el && el.querySelector) {
              const value = el.querySelector('.value');
              if (value) value.textContent = 'API Fehler';
            }
          });
        });
    }

    function updateConsumptionStats(history, calorific, correction) {
      const el = (id) => document.getElementById(id);
      
      if (!history || history.length < 2) {
        ['statToday', 'statWeek', 'statMonth', 'statAvg'].forEach(id => {
          if (el(id)) el(id).textContent = '-- m³';
          if (el(id + 'Kwh')) el(id + 'Kwh').textContent = '-- kWh';
        });
        return;
      }
      
      const now = Date.now() / 1000;
      const latest = history[history.length - 1];
      const oldest = history[0];
      
      // Start of today (00:00:00)
      const startOfToday = new Date();
      startOfToday.setHours(0, 0, 0, 0);
      const todayTimestamp = startOfToday.getTime() / 1000;
      
      // Start of this week (Monday 00:00:00)
      const startOfWeek = new Date();
      const dayOfWeek = startOfWeek.getDay(); // 0 = Sonntag, 1 = Montag
      const daysToMonday = dayOfWeek === 0 ? 6 : dayOfWeek - 1;
      startOfWeek.setDate(startOfWeek.getDate() - daysToMonday);
      startOfWeek.setHours(0, 0, 0, 0);
      const weekTimestamp = startOfWeek.getTime() / 1000;
      
      // Start of this month (1st day 00:00:00)
      const startOfMonth = new Date();
      startOfMonth.setDate(1);
      startOfMonth.setHours(0, 0, 0, 0);
      const monthTimestamp = startOfMonth.getTime() / 1000;
      
      // Finde den letzten Messwert VOR dem jeweiligen Zeitpunkt
      let todayStart = null;
      let weekStart = null;
      let monthStart = null;
      
      // Suche rückwärts nach dem letzten Wert vor dem Zeitpunkt
      for (let i = history.length - 1; i >= 0; i--) {
        if (!todayStart && history[i].timestamp < todayTimestamp) {
          todayStart = history[i];
        }
        if (!weekStart && history[i].timestamp < weekTimestamp) {
          weekStart = history[i];
        }
        if (!monthStart && history[i].timestamp < monthTimestamp) {
          monthStart = history[i];
        }
        if (todayStart && weekStart && monthStart) break;
      }
      
      // Falls kein Wert vor dem Zeitpunkt existiert, nutze den ersten verfügbaren
      if (!todayStart) todayStart = history[0];
      if (!weekStart) weekStart = history[0];
      if (!monthStart) monthStart = history[0];
      
      // Berechne Differenzen
      const todayDiff = latest.volume - todayStart.volume;
      const weekDiff = latest.volume - weekStart.volume;
      const monthDiff = latest.volume - monthStart.volume;
      
      // Durchschnitt pro Tag über die gesamte Historie
      const totalDiff = latest.volume - oldest.volume;
      const daysSinceStart = (latest.timestamp - oldest.timestamp) / 86400;
      const avgPerDay = daysSinceStart > 0 ? totalDiff / daysSinceStart : 0;
      
      // Anzeigen mit Null-Checks
      if (el('statToday')) el('statToday').textContent = todayDiff.toFixed(2) + ' m³';
      if (el('statTodayKwh')) el('statTodayKwh').textContent = (todayDiff * calorific * correction).toFixed(3) + ' kWh';
      
      if (el('statWeek')) el('statWeek').textContent = weekDiff.toFixed(2) + ' m³';
      if (el('statWeekKwh')) el('statWeekKwh').textContent = (weekDiff * calorific * correction).toFixed(3) + ' kWh';
      
      if (el('statMonth')) el('statMonth').textContent = monthDiff.toFixed(2) + ' m³';
      if (el('statMonthKwh')) el('statMonthKwh').textContent = (monthDiff * calorific * correction).toFixed(3) + ' kWh';
      
      if (el('statAvg')) el('statAvg').textContent = avgPerDay.toFixed(3) + ' m³';
      if (el('statAvgKwh')) el('statAvgKwh').textContent = (avgPerDay * calorific * correction).toFixed(3) + ' kWh';
    }

    function loadConfig() {
      fetch('/api/config')
        .then(r => r.json())
        .then(data => {
          const el = (id) => document.getElementById(id);
          
          if (el('ssid')) el('ssid').value = data.ssid;
          if (el('password')) el('password').value = data.password;
          if (el('hostname')) el('hostname').value = data.hostname || 'ESP32-GasZaehler';
          if (el('mqtt_server')) el('mqtt_server').value = data.mqtt_server;
          if (el('mqtt_port')) el('mqtt_port').value = data.mqtt_port;
          if (el('mqtt_user')) el('mqtt_user').value = data.mqtt_user || '';
          if (el('mqtt_pass')) el('mqtt_pass').value = data.mqtt_pass || '';
          if (el('mqtt_topic')) el('mqtt_topic').value = data.mqtt_topic;
          if (el('poll_interval')) el('poll_interval').value = data.poll_interval;
          if (el('gas_calorific')) el('gas_calorific').value = (data.gas_calorific || 10.0).toFixed(6);
          if (el('gas_correction')) el('gas_correction').value = (data.gas_correction || 1.0).toFixed(6);
          
          // Static IP Felder
          const useStaticIp = data.use_static_ip || false;
          if (el('use_static_ip')) el('use_static_ip').checked = useStaticIp;
          if (el('static_ip')) el('static_ip').value = data.static_ip || '192.168.1.100';
          if (el('static_gateway')) el('static_gateway').value = data.static_gateway || '192.168.1.1';
          if (el('static_subnet')) el('static_subnet').value = data.static_subnet || '255.255.255.0';
          if (el('static_dns')) el('static_dns').value = data.static_dns || '192.168.1.1';
          if (el('staticIpFields')) el('staticIpFields').style.display = useStaticIp ? 'block' : 'none';
          
          // Event Listener für Static IP Toggle
          if (el('use_static_ip')) {
            el('use_static_ip').addEventListener('change', function() {
              if (el('staticIpFields')) el('staticIpFields').style.display = this.checked ? 'block' : 'none';
            });
          }
        })
        .catch(e => console.error('Fehler:', e));
    }

