fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    function refreshLogs() {
      fetch('/api/logs')
        .then(r => r.json())
        .then(data => {
          const container = document.getElementById('logContainer');
          if (!data.logs || data.logs.length === 0) {
            container.innerHTML = '<div style="text-align: center; color: var(--text-muted); padding: 20px;">Keine Logs verfügbar</div>';
            return;
          }
          
          let html = '';
          const now = Date.now();
          
          // Neueste zuerst
          for (let i = data.logs.length - 1; i >= 0; i--) {
            const log = data.logs[i];
            
            
            // Absolute Zeit berechnen (jetzt - uptime + log timestamp)
            const logDate = new Date(now - (data.uptime - log.timestamp));
            const timeStr = logDate.toLocaleTimeString('de-DE', {
              hour: '2-digit',
              minute: '2-digit',
              second: '2-digit'
            });
            
            // Farben für verschiedene Log-Typen
            let icon = '•';
            let color = 'var(--text-primary)';
            let category = '';
            const msg = log.message.toLowerCase();
            
            // Fehler & Warnungen
            if (msg.includes('fehler') || msg.includes('error') || msg.includes('failed')) {
              color = '#ef4444'; icon = '❌';
            } else if (msg.includes('warnung') || msg.includes('warning') || msg.includes('timeout')) {
              color = '#fbbf24'; icon = '⚠';
            } 
            // Erfolg
            else if (msg.includes('verbunden') || msg.includes('success') || msg.includes('ok') || msg.includes('erfolgreich')) {
              color = '#10b981'; icon = '✓';
            } 
            // Kategorien
            else if (msg.includes('m-bus')) {
              color = '#8b5cf6'; icon = '📡'; category = 'M-Bus';
            } else if (msg.includes('mqtt')) {
              color = '#06b6d4'; icon = '🔗'; category = 'MQTT';
            } else if (msg.includes('wifi') || msg.includes('wlan')) {
              color = '#3b82f6'; icon = '📶'; category = 'WiFi';
            } else if (msg.includes('start') || msg.includes('boot') || msg.includes('setup')) {
              color = '#3b82f6'; icon = '🚀';
            }
            
            html += `<div style="margin-bottom: 8px; padding: 8px; background: rgba(0,0,0,0.2); border-radius: 6px; border-left: 3px solid ${color};">`;
            html += `<span style="color: var(--text-secondary); font-weight: 600; font-size: 0.85em;">[${timeStr}]</span> `;
            
            html += `<span style="color: ${color}; margin: 0 4px;">${icon}</span>`;
            if (category) {
              html += `<span style="color: ${color}; font-weight: 600; font-size: 0.85em; background: rgba(0,0,0,0.3); padding: 2px 6px; border-radius: 3px; margin-right: 6px;">${category}</span>`;
            }
            html += `<span style="color: ${color};">${log.message}</span>`;
            html += '</div>';
          }
          container.innerHTML = html;
          
          // Auto-scroll nach unten wenn ntig
          if (container.scrollHeight - container.scrollTop < container.clientHeight + 100) {
            container.scrollTop = container.scrollHeight;
          }
        })
        .catch(e => console.error('Fehler:', e));
    }

    function scanWifi() {
      const btn = event.target;
      const originalText = btn.textContent;
      btn.textContent = 'Scanne...';
      btn.disabled = true;
      
      fetch('/api/wifi/scan')
        .then(r => r.json())
        .then(data => {
          const select = document.getElementById('wifiList');
          select.innerHTML = '<option value="">-- Netzwerk auswhlen --</option>';
          
          data.networks.forEach(net => {
            const option = document.createElement('option');
            const signal = net.rssi > -50 ? '' : net.rssi > -70 ? '' : '';
            const lock = net.encryption ? '' : '';
            option.value = net.ssid;
            option.textContent = `${net.ssid} ${signal} ${lock} (${net.rssi}dBm)`;
            select.appendChild(option);
          });
          
          select.style.display = 'block';
          btn.textContent = originalText;
          btn.disabled = false;
        })
        .catch(e => {
          console.error('Fehler:', e);
          alert('WiFi-Scan fehlgeschlagen!');
          btn.textContent = originalText;
          btn.disabled = false;
        });
    }

    function selectWifi() {
      const select = document.getElementById('wifiList');
      const ssidInput = document.getElementById('ssid');
      if (select.value) {
        ssidInput.value = select.value;
      }
    }

    function saveConfig(event) {
      event.preventDefault();
      const formData = new FormData(event.target);
      const config = {
        ssid: formData.get('ssid'),
        password: formData.get('password'),
        hostname: formData.get('hostname'),
        mqtt_server: formData.get('mqtt_server'),
        mqtt_port: parseInt(formData.get('mqtt_port')),
        mqtt_user: formData.get('mqtt_user'),
        mqtt_pass: formData.get('mqtt_pass'),
        mqtt_topic: formData.get('mqtt_topic'),
        // Ensure we send a valid integer: prefer parsed FormData, fallback to element value, then default 30
        poll_interval: (function(){
          const v = parseInt(formData.get('poll_interval'));
          if (!isNaN(v) && v > 0) return v;
          const el = document.getElementById('poll_interval');
          const ev = el ? parseInt(el.value) : NaN;
          if (!isNaN(ev) && ev > 0) return ev;
          return 30;
        })(),
        gas_calorific: parseFloat(formData.get('gas_calorific')),
        gas_correction: parseFloat(formData.get('gas_correction')),
        use_static_ip: document.getElementById('use_static_ip').checked,
        static_ip: formData.get('static_ip'),
        static_gateway: formData.get('static_gateway'),
        static_subnet: formData.get('static_subnet'),
        static_dns: formData.get('static_dns')
      };
      
      fetch('/api/config', {
        method: 'POST',
        headers: { 'Content-Type': 'application/json' },
        body: JSON.stringify(config)
      })
      .then(r => r.json())
      .then(data => {
        const alert = document.getElementById('configAlert');
        alert.textContent = 'Einstellungen gespeichert! ESP32 startet neu...';
        alert.className = 'alert success';
        alert.style.display = 'block';
        setTimeout(() => { location.reload(); }, 3000);
      })
      .catch(e => {
        const alert = document.getElementById('configAlert');
        alert.textContent = 'Fehler beim Speichern!';
        alert.className = 'alert error';
        alert.style.display = 'block';
      });
    }

    function formatUptime(ms) {
      const s = Math.floor(ms / 1000);
      const m = Math.floor(s / 60);
      const h = Math.floor(m / 60);
      const d = Math.floor(h / 24);
      if (d > 0) return d + 'd ' + (h % 24) + 'h';
      if (h > 0) return h + 'h ' + (m % 60) + 'm';
      return m + 'm ' + (s % 60) + 's';
    }

