fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    let myChart = null;
    
    function drawChart(history) {
      if (!history || history.length === 0) {
        const canvas = document.getElementById('chart');
        const ctx = canvas.getContext('2d');
        ctx.clearRect(0, 0, canvas.width, canvas.height);
        ctx.fillStyle = '#999';
        ctx.font = '16px sans-serif';
        ctx.textAlign = 'center';
        ctx.fillText('Keine Daten für diesen Zeitraum', canvas.width / 2, canvas.height / 2);
        if (myChart) {
          myChart.destroy();
          myChart = null;
        }
        return;
      }
      
      if (history.length < 2) return;
      
      // Daten für Chart.js aufbereiten
      const chartData = history.map(point => ({
        x: point.timestamp * 1000, // Chart.js benötigt Millisekunden
        y: point.volume
      }));
      
      // Min/Max für x-Achse berechnen
      const timestamps = chartData.map(d => d.x);
      const minTime = Math.min(...timestamps);
      const maxTime = Math.max(...timestamps);
      
      // Zeitachse-Einheit automatisch basierend auf Datenmenge
      const daysDiff = (maxTime - minTime) / (1000 * 60 * 60 * 24);
      let timeUnit = 'hour';
      let displayFormats = {hour: 'HH:mm'};
      let tooltipFormat = 'dd.MM HH:mm';
      let stepSize = undefined;
      let maxTicksLimit = undefined;
      
      if (daysDiff > 180) {
        timeUnit = 'month';
        displayFormats = {month: 'MMM yyyy'};
        tooltipFormat = 'MMM yyyy';
        maxTicksLimit = 20;
      } else if (daysDiff > 60) {
        timeUnit = 'week';
        displayFormats = {week: 'dd.MM'};
        tooltipFormat = 'dd.MM.yyyy';
        maxTicksLimit = 20;
      } else if (daysDiff > 14) {
        timeUnit = 'day';
        displayFormats = {day: 'dd.MM'};
        tooltipFormat = 'dd.MM.yyyy';
        maxTicksLimit = 30;
      } else if (daysDiff > 2) {
        timeUnit = 'hour';
        displayFormats = {hour: 'dd.MM HH:mm'};
        tooltipFormat = 'dd.MM HH:mm';
        maxTicksLimit = 25;
      } else {
        timeUnit = 'hour';
        displayFormats = {hour: 'HH:mm'};
        tooltipFormat = 'dd.MM HH:mm';
        maxTicksLimit = 48;
      }
      
      // Altes Chart zerstören
      if (myChart) {
        myChart.destroy();
      }
      
      const ctx = document.getElementById('chart').getContext('2d');
      myChart = new Chart(ctx, {
        type: 'line',
        data: {
          datasets: [{
            label: 'Gasverbrauch (m³)',
            data: chartData,
            borderColor: '#667eea',
            backgroundColor: 'rgba(102, 126, 234, 0.1)',
            borderWidth: 3,
            pointRadius: 4,
            pointHoverRadius: 6,
            pointBackgroundColor: '#667eea',
            pointBorderColor: '#fff',
            pointBorderWidth: 2,
            tension: 0.4,
            fill: true
          }]
        },
        options: {
          responsive: true,
          maintainAspectRatio: false,
          interaction: {
            mode: 'nearest',
            axis: 'x',
            intersect: false
          },
          plugins: {
            legend: {
              display: true,
              labels: {
                color: '#666',
                font: {size: 14}
              }
            },
            tooltip: {
              callbacks: {
                title: function(context) {
                  const date = new Date(context[0].parsed.x);
                  return date.toLocaleString('de-DE', {
                    day: '2-digit',
                    month: '2-digit',
                    year: 'numeric',
                    hour: '2-digit',
                    minute: '2-digit'
                  });
                },
                label: function(context) {
                  return ' ' + context.parsed.y.toFixed(2) + ' m³';
                }
              }
            }
          },
          scales: {
            x: {
              type: 'time',
              time: {
                unit: timeUnit,
                displayFormats: displayFormats,
                tooltipFormat: tooltipFormat,
                stepSize: stepSize
              },
              min: minTime,
              max: maxTime,
              grid: {
                color: 'rgba(0, 0, 0, 0.05)'
              },
              ticks: {
                color: '#666',
                maxRotation: 45,
                minRotation: 0,
                autoSkip: true,
                maxTicksLimit: maxTicksLimit
              }
            },
            y: {
              beginAtZero: false,
              grid: {
                color: 'rgba(0, 0, 0, 0.05)'
              },
              ticks: {
                color: '#666',
                callback: function(value) {
                  return value.toFixed(2) + ' m³';
                }
              }
            }
          }
        });
      });
    }
    
    // Chart.js kümmert sich um Tooltips
    document.addEventListener('DOMContentLoaded', function() {
        chartZoom *= delta;
        chartZoom = Math.max(0.5, Math.min(3, chartZoom));
        drawChart(filterHistoryByTimeRange(fullHistoryData));
    });

    // Diagnose-Funktionen
    function testMQTT() {
      const result = document.getElementById('diagResult');
      result.style.display = 'block';
      result.style.color = 'var(--text-secondary)';
      result.innerHTML = '<span style="color: var(--accent-color);">⏳</span> Teste MQTT-Verbindung...';
      
      fetch('/api/test/mqtt')
        .then(r => r.json())
        .then(data => {
          const status = data.connected ? '<span style="color: #10b981;">✓ Verbunden</span>' : '<span style="color: #ef4444;">✗ Getrennt</span>';
          result.innerHTML = `<div style="color: var(--text-primary); line-height: 1.8;">
            <strong style="color: var(--accent-color); font-size: 1.1em;">📡 MQTT Test</strong><br><br>
            <span style="color: var(--text-secondary);">Server:</span> <code style="color: var(--accent-color);">${data.server}:${data.port}</code><br>
            <span style="color: var(--text-secondary);">Status:</span> ${status}<br>
            <span style="color: var(--text-secondary);">Last Will:</span> <code>${data.availability_topic}</code><br>
            <span style="color: var(--text-secondary);">Antwortzeit:</span> <strong style="color: #10b981;">${data.response_time}</strong>
          </div>`;
        })
        .catch(e => {
          result.innerHTML = '<span style="color: #ef4444;">❌ MQTT Test fehlgeschlagen: ' + e + '</span>';
        });
    }

    function testWiFi() {
      const result = document.getElementById('diagResult');
      result.style.display = 'block';
      result.style.color = 'var(--text-secondary)';
      result.innerHTML = '<span style="color: var(--accent-color);">⏳</span> Prüfe WiFi-Verbindung...';
      
      fetch('/api/test/wifi')
        .then(r => r.json())
        .then(data => {
          let quality = 'Schlecht';
          let qualityColor = '#ef4444';
          if (data.rssi >= -50) { quality = 'Ausgezeichnet'; qualityColor = '#10b981'; }
          else if (data.rssi >= -60) { quality = 'Gut'; qualityColor = '#10b981'; }
          else if (data.rssi >= -70) { quality = 'Mittel'; qualityColor = '#fbbf24'; }
          
          result.innerHTML = `<div style="color: var(--text-primary); line-height: 1.8;">
            <strong style="color: var(--accent-color); font-size: 1.1em;">📶 WiFi Status</strong><br><br>
            <span style="color: var(--text-secondary);">SSID:</span> <code style="color: var(--accent-color);">${data.ssid}</code><br>
            <span style="color: var(--text-secondary);">Signal:</span> <strong style="color: ${qualityColor};">${data.rssi} dBm (${quality})</strong><br>
            <span style="color: var(--text-secondary);">Kanal:</span> ${data.channel}<br>
            <span style="color: var(--text-secondary);">IP:</span> <code style="color: #10b981; font-weight: bold;">${data.ip}</code><br>
            <span style="color: var(--text-secondary);">MAC:</span> <code>${data.mac}</code><br>
            <span style="color: var(--text-secondary);">Hostname:</span> <code>${data.hostname}</code>
          </div>`;
        })
        .catch(e => {
          result.innerHTML = '<span style="color: #ef4444;">❌ WiFi Test fehlgeschlagen: ' + e + '</span>';
        });
    }

    function pingGateway() {
      const result = document.getElementById('diagResult');
      result.style.display = 'block';
      result.style.color = 'var(--text-secondary)';
      result.innerHTML = '<span style="color: var(--accent-color);">⏳</span> Pinge Gateway...';
      
      fetch('/api/test/ping')
        .then(r => r.json())
        .then(data => {
          const reachable = data.reachable ? '<span style="color: #10b981;">✓ Ja</span>' : '<span style="color: #ef4444;">✗ Nein</span>';
          result.innerHTML = `<div style="color: var(--text-primary); line-height: 1.8;">
            <strong style="color: var(--accent-color); font-size: 1.1em;">🌐 Gateway Ping</strong><br><br>
            <span style="color: var(--text-secondary);">Gateway:</span> <code style="color: var(--accent-color); font-weight: bold;">${data.gateway}</code><br>
            <span style="color: var(--text-secondary);">Erreichbar:</span> ${reachable}<br>
            <span style="color: var(--text-secondary);">Antwortzeit:</span> <strong style="color: #10b981;">${data.response_time}</strong><br>
            <span style="color: var(--text-secondary);">DNS:</span> <code>${data.dns}</code>
          </div>`;
        })
        .catch(e => {
          result.innerHTML = '<span style="color: #ef4444;">❌ Ping fehlgeschlagen: ' + e + '</span>';
        });
    }

