fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    function refreshMBusData() {
      // Trigger M-Bus Poll
      fetch('/api/mbus/trigger', { method: 'POST' })
        .then(r => r.json())
        .then(data => {
          console.log('M-Bus Trigger:', data.message);
          // Warte 2 Sekunden und lade dann Stats
          setTimeout(() => {
            fetch('/api/mbus/stats')
              .then(r => r.json())
              .then(stats => {
                const rate = stats.total > 0 ? ((stats.successful / stats.total) * 100).toFixed(1) : 0;
                const avgTime = stats.total > 0 ? (stats.total_time / stats.total).toFixed(0) : 0;
                
                const el = (id) => document.getElementById(id);
                if (el('mbusSuccessRate')) el('mbusSuccessRate').textContent = rate + '%';
                if (el('mbusAvgResponse')) el('mbusAvgResponse').textContent = avgTime + ' ms';
                if (el('mbusLastResponse')) el('mbusLastResponse').textContent = stats.last_response + ' ms';
                if (el('mbusTotalPolls')) el('mbusTotalPolls').textContent = stats.total;
                if (el('mbusHexDump')) el('mbusHexDump').textContent = stats.hex_dump || 'Keine Daten';
              })
              .catch(e => console.error('Stats Fehler:', e));
          }, 2000);
        })
        .catch(e => console.error('Trigger Fehler:', e));
    }

    function resetErrorStats() {
      if (confirm('Möchten Sie die Fehlerstatistik wirklich zurücksetzen?')) {
        fetch('/api/errors/reset', { method: 'POST' })
          .then(r => r.json())
          .then(data => {
            console.log('Fehlerstatistik zurückgesetzt');
            // UI sofort aktualisieren
            document.getElementById('errMbusTimeout').textContent = '0';
            document.getElementById('errMbusParse').textContent = '0';
            document.getElementById('errMqtt').textContent = '0';
            document.getElementById('errWifi').textContent = '0';
            document.getElementById('lastError').style.display = 'none';
            alert('✅ Fehlerstatistik wurde zurückgesetzt!');
          })
          .catch(e => {
            console.error('Reset Fehler:', e);
            alert('❌ Fehler beim Zurücksetzen!');
          });
      }
    }

    function exportData() {
      fetch('/api/data')
        .then(r => r.json())
        .then(data => {
          if (!data.history || data.history.length === 0) {
            alert('Keine Daten zum Exportieren vorhanden!');
            return;
          }
          
          let csv = 'Timestamp,Unix Time,Volume (m),Energy (kWh)\n';
          data.history.forEach(point => {
            const date = new Date(point.timestamp * 1000);
            const dateStr = date.toISOString();
            const energy = (point.volume * data.calorific * data.correction).toFixed(1);
            csv += `${dateStr},${point.timestamp},${point.volume.toFixed(2)},${energy}\n`;
          });
          
          const blob = new Blob([csv], { type: 'text/csv' });
          const url = window.URL.createObjectURL(blob);
          const a = document.createElement('a');
          a.href = url;
          a.download = 'gaszaehler_export_' + new Date().toISOString().split('T')[0] + '.csv';
          a.click();
          window.URL.revokeObjectURL(url);
          
          const result = document.getElementById('diagResult');
          result.style.display = 'block';
          result.textContent = ` CSV Export erfolgreich!\n\n${data.history.length} Datenpunkte exportiert\nDatei: ${a.download}`;
          result.style.color = '#28a745';
        })
        .catch(e => {
          alert('Export fehlgeschlagen: ' + e);
        });
    }

    // Dark Mode initialisieren
    initDarkMode();
    
    updateData();
    updateInterval = setInterval(updateData, 5000);
  </script>
</body>
</html>
)rawliteral";

void handleRoot() {
  String html = String(htmlPage);
  html.replace("%VERSION%", FIRMWARE_VERSION);
  server.send(200, "text/html", html);
}

void handleAPI() {
  String json = "{";
  json += "\"volume\":" + String(lastVolume, 2) + ",";
  json += "\"wifiConnected\":" + String(WiFi.status() == WL_CONNECTED ? "true" : "false") + ",";
  json += "\"wifiRSSI\":" + String(WiFi.RSSI()) + ",";
  json += "\"mqttConnected\":" + String(client.connected() ? "true" : "false") + ",";
  json += "\"apMode\":" + String(apMode ? "true" : "false") + ",";
  json += "\"apSSID\":\"" + String(ap_ssid) + "\",";
  json += "\"ipAddress\":\"" + (apMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\",";
  json += "\"uptime\":" + String(millis()) + ",";
  json += "\"lastUpdate\":" + String(measurements.empty() ? 0 : measurements.back().timestamp) + ",";
  json += "\"timeInitialized\":" + String(timeInitialized ? "true" : "false") + ",";
  json += "\"pollInterval\":" + String(poll_interval / 1000) + ",";
  // backward-compatible key expected by the WebUI
  json += "\"poll_interval\":" + String(poll_interval / 1000) + ",";
  json += "\"calorific\":" + String(gas_calorific_value, 6) + ",";
  json += "\"correction\":" + String(gas_correction_factor, 6) + ",";
  json += "\"system\":{";
  json += "\"freeHeap\":" + String(ESP.getFreeHeap()) + ",";
  json += "\"heapSize\":" + String(ESP.getHeapSize()) + ",";
  json += "\"flashSize\":" + String(ESP.getFlashChipSize()) + ",";
  json += "\"sketchSize\":" + String(ESP.getSketchSize()) + ",";
  json += "\"freeSketch\":" + String(ESP.getFreeSketchSpace()) + ",";
  json += "\"chipModel\":\"" + String(ESP.getChipModel()) + "\",";
  json += "\"chipCores\":" + String(ESP.getChipCores()) + ",";
  json += "\"cpuFreq\":" + String(ESP.getCpuFreqMHz());
  json += "},";
  json += "\"errors\":{";
  json += "\"mbusTimeouts\":" + String(errorStats.mbusTimeouts) + ",";
  json += "\"mbusParseErrors\":" + String(errorStats.mbusParseErrors) + ",";
  json += "\"mqttErrors\":" + String(errorStats.mqttErrors) + ",";
  json += "\"wifiDisconnects\":" + String(errorStats.wifiDisconnects) + ",";
  json += "\"lastError\":\"" + String(errorStats.lastErrorMsg) + "\",";
  json += "\"lastErrorTime\":" + String(errorStats.lastError);
  json += "},";
  json += "\"history\":[";
  for (size_t i = 0; i < measurements.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"timestamp\":" + String(measurements[i].timestamp) + 
            ",\"volume\":" + String(measurements[i].volume, 2) + "}";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

void handleConfigGet() {
  String json = "{";
  json += "\"ssid\":\"" + String(ssid) + "\",";
  json += "\"password\":\"" + String(password) + "\",";
  json += "\"hostname\":\"" + String(hostname) + "\",";
  json += "\"mqtt_server\":\"" + String(mqtt_server) + "\",";
  json += "\"mqtt_port\":" + String(mqtt_port) + ",";
  json += "\"mqtt_user\":\"" + String(mqtt_user) + "\",";
  json += "\"mqtt_pass\":\"" + String(mqtt_pass) + "\",";
  json += "\"mqtt_topic\":\"" + String(mqtt_topic) + "\",";
  json += "\"poll_interval\":" + String(poll_interval / 1000) + ",";
  json += "\"gas_calorific\":" + String(gas_calorific_value, 6) + ",";
  json += "\"gas_correction\":" + String(gas_correction_factor, 6);
  json += "}";
  server.send(200, "application/json", json);
}

void handleLogs() {
  String json = "{";
  json += "\"uptime\":" + String(millis()) + ",";
  json += "\"logs\":[";
  for (size_t i = 0; i < logBuffer.size(); i++) {
    if (i > 0) json += ",";
    json += "{";
    json += "\"timestamp\":" + String(logBuffer[i].timestamp);
    json += ",\"message\":\"" + logBuffer[i].message + "\"";
    json += "}";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

