fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
void handleDiagnostics() {
  String json = "{\"mbus\":{";
  json += "\"total\":" + String(mbusStats.totalPolls) + ",";
  json += "\"successful\":" + String(mbusStats.successfulPolls) + ",";
  json += "\"avgResponseTime\":" + String(mbusStats.avgResponseTime) + ",";
  json += "\"lastResponseTime\":" + String(mbusStats.lastResponseTime);
  json += "}}";
  server.send(200, "application/json", json);
}

void handleWifiScan() {
  Serial.println("WiFi-Scan gestartet...");
  int n = WiFi.scanNetworks();
  
  String json = "{\"networks\":[";
  for (int i = 0; i < n; i++) {
    if (i > 0) json += ",";
    json += "{";
    json += "\"ssid\":\"" + WiFi.SSID(i) + "\"";
    json += ",\"rssi\":" + String(WiFi.RSSI(i));
    json += ",\"encryption\":" + String(WiFi.encryptionType(i) != WIFI_AUTH_OPEN ? "true" : "false");
    json += "}";
  }
  json += "]}";
  
  WiFi.scanDelete();
  server.send(200, "application/json", json);
  Serial.println("WiFi-Scan abgeschlossen: " + String(n) + " Netzwerke gefunden");
}

// Diagnose-Endpunkte
void handleTestMQTT() {
  unsigned long start = millis();
  bool connected = client.connected();
  unsigned long responseTime = millis() - start;
  
  String json = "{";
  json += "\"server\":\"" + String(mqtt_server) + "\",";
  json += "\"port\":" + String(mqtt_port) + ",";
  json += "\"connected\":" + String(connected ? "true" : "false") + ",";
  json += "\"availability_topic\":\"" + String(mqtt_availability_topic) + "\",";
  json += "\"response_time\":" + String(responseTime);
  json += "}";
  server.send(200, "application/json", json);
}

void handleTestWiFi() {
  String json = "{";
  json += "\"ssid\":\"" + WiFi.SSID() + "\",";
  json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  json += "\"channel\":" + String(WiFi.channel()) + ",";
  json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"mac\":\"" + WiFi.macAddress() + "\",";
  json += "\"hostname\":\"" + String(hostname) + "\"";
  json += "}";
  server.send(200, "application/json", json);
}

void handleTestPing() {
  IPAddress gateway = WiFi.gatewayIP();
  bool reachable = Ping.ping(gateway, 1);
  
  String json = "{";
  json += "\"gateway\":\"" + gateway.toString() + "\",";
  json += "\"reachable\":" + String(reachable ? "true" : "false") + ",";
  json += "\"response_time\":\"" + String(reachable ? "<10ms" : "timeout") + "\",";
  json += "\"dns\":\"" + WiFi.dnsIP().toString() + "\"";
  json += "}";
  server.send(200, "application/json", json);
}

void handleMBusStats() {
  String json = "{";
  json += "\"total\":" + String(mbusStats.totalPolls) + ",";
  json += "\"successful\":" + String(mbusStats.successfulPolls) + ",";
  json += "\"total_time\":" + String(mbusStats.totalResponseTime) + ",";
  json += "\"last_response\":" + String(mbusStats.lastResponseTime) + ",";
  json += "\"hex_dump\":\"" + mbusStats.lastHexDump + "\"";
  json += "}";
  server.send(200, "application/json", json);
}

void handleMBusTrigger() {
  // Manuelle M-Bus Abfrage starten
  if (mbusState == MBUS_IDLE) {
    // Poll Frame senden
    uint8_t pollFrame[5] = {0x10, 0x5B, 0x00, 0x5B, 0x16};
    mbusSerial.write(pollFrame, sizeof(pollFrame));
    mbusSerial.flush();
    mbusLen = 0;
    mbusLastAction = millis();
    mbusState = MBUS_WAIT_RESPONSE;
    
    Serial.println(ANSI_YELLOW "M-Bus: Manuelle Abfrage gestartet" ANSI_RESET);
    server.send(200, "application/json", "{\"status\":\"triggered\",\"message\":\"M-Bus Abfrage gestartet\"}");
  } else {
    server.send(409, "application/json", "{\"status\":\"busy\",\"message\":\"M-Bus Abfrage läuft bereits\"}");
  }
}

void handleErrorReset() {
  // Fehlerstatistik zurücksetzen
  errorStats.mbusTimeouts = 0;
  errorStats.mbusParseErrors = 0;
  errorStats.mqttErrors = 0;
  errorStats.wifiDisconnects = 0;
  lastErrorMessage = "";
  
  Serial.println("Fehlerstatistik zurückgesetzt");
  server.send(200, "application/json", "{\"status\":\"ok\",\"message\":\"Fehlerstatistik zurückgesetzt\"}");
}

void handleConfigPost() {
  Serial.println("DEBUG: handleConfigPost() aufgerufen");
  Serial.println("DEBUG: hasArg('plain') = " + String(server.hasArg("plain") ? "true" : "false"));
  Serial.println("DEBUG: args() = " + String(server.args()));
  
  if (server.hasArg("plain")) {
    String body = server.arg("plain");
    Serial.println("DEBUG: Body length = " + String(body.length()));
    // Debug: show incoming POST body (truncated) to help diagnose client-side issues
    String tb = body;
    if (tb.length() > 300) tb = tb.substring(0, 300) + "...";
    Serial.println("DEBUG POST /api/config body: " + tb);
    
    // Einfaches JSON Parsing (fr kleine Daten ausreichend)
    int idx;
    
    idx = body.indexOf("\"ssid\":\"");
    if (idx >= 0) {
      int start = idx + 8;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(ssid, sizeof(ssid));
    }
    
    idx = body.indexOf("\"password\":\"");
    if (idx >= 0) {
      int start = idx + 12;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(password, sizeof(password));
    }
    
    idx = body.indexOf("\"hostname\":\"");
    if (idx >= 0) {
      int start = idx + 12;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(hostname, sizeof(hostname));
    }
    
    idx = body.indexOf("\"mqtt_server\":\"");
    if (idx >= 0) {
      int start = idx + 15;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(mqtt_server, sizeof(mqtt_server));
    }
    
    idx = body.indexOf("\"mqtt_port\":");
    if (idx >= 0) {
      int start = idx + 12;
      int end = body.indexOf(",", start);
      if (end < 0) end = body.indexOf("}", start);
      mqtt_port = body.substring(start, end).toInt();
    }
    
    idx = body.indexOf("\"mqtt_user\":\"");
    if (idx >= 0) {
      int start = idx + 13;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(mqtt_user, sizeof(mqtt_user));
    }
    
