fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
    idx = body.indexOf("\"mqtt_pass\":\"");
    if (idx >= 0) {
      int start = idx + 13;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(mqtt_pass, sizeof(mqtt_pass));
    }
    
    idx = body.indexOf("\"mqtt_topic\":\"");
    if (idx >= 0) {
      int start = idx + 14;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(mqtt_topic, sizeof(mqtt_topic));
    }
    
    idx = body.indexOf("\"poll_interval\":");
    if (idx >= 0) {
      int start = idx + 16; // Nach "poll_interval":
      // Überspringe Leerzeichen und Doppelpunkt
      while (start < body.length() && (body.charAt(start) == ':' || body.charAt(start) == ' ')) start++;
      
      int end = start;
      // Finde das Ende der Zahl (Komma, Leerzeichen oder schließende Klammer)
      while (end < body.length() && body.charAt(end) >= '0' && body.charAt(end) <= '9') end++;
      
      String valueStr = body.substring(start, end);
      valueStr.trim();
      int seconds = valueStr.toInt();
      
      Serial.println("DEBUG: Parsing poll_interval: start=" + String(start) + " end=" + String(end) + " valueStr='" + valueStr + "' seconds=" + String(seconds));
      
      // Akzeptiere nur gültige Bereiche (10s .. 300s). Bei ungültigen/fehlenden Werten
      // wird der bisherige poll_interval nicht überschrieben.
      if (seconds >= 10 && seconds <= 300) {
        Serial.println("DEBUG: poll_interval aus JSON: " + valueStr + " -> " + String(seconds) + " Sekunden");
        poll_interval = (unsigned long)seconds * 1000UL; // Sekunden -> ms
        if (poll_interval < 10000UL) poll_interval = 10000UL; // Minimum 10s (safety)
        if (poll_interval > 300000UL) poll_interval = 300000UL; // Maximum 5min
        Serial.println("DEBUG: poll_interval nach Validierung: " + String(poll_interval) + " ms");

        // Persistiere sofort, um sicherzustellen dass der Wert vor dem Neustart
        // in den Preferences steht (reduziert Race-Condition vor saveConfig()).
        preferences.begin("gas-config", false);
        size_t written = preferences.putULong("poll_interval", poll_interval);
        // Readback prüfen vor end() - end() schreibt automatisch in Flash
        unsigned long rb = preferences.getULong("poll_interval", 0);
        preferences.end(); // end() committet automatisch
        Serial.println("DEBUG: poll_interval sofort in Flash geschrieben: " + String(poll_interval) + " ms (written=" + String(written) + " readback=" + String(rb) + ")");
      } else {
        Serial.println("DEBUG: poll_interval ungültig oder nicht gesetzt im JSON ('" + valueStr + "'), beibehalten: " + String(poll_interval) + " ms");
      }
    }
    
    idx = body.indexOf("\"gas_calorific\":");
    if (idx >= 0) {
      int start = idx + 16;
      int end = body.indexOf(",", start);
      if (end < 0) end = body.indexOf("}", start);
      gas_calorific_value = body.substring(start, end).toFloat();
      if (gas_calorific_value < 8.0 || gas_calorific_value > 13.0) {
        gas_calorific_value = 10.0; // Fallback bei ungültigen Werten
      }
    }
    
    idx = body.indexOf("\"gas_correction\":");
    if (idx >= 0) {
      int start = idx + 17;
      int end = body.indexOf(",", start);
      if (end < 0) end = body.indexOf("}", start);
      gas_correction_factor = body.substring(start, end).toFloat();
      if (gas_correction_factor < 0.90 || gas_correction_factor > 1.10) {
        gas_correction_factor = 1.0; // Fallback bei ungültigen Werten
      }
    }
    
    idx = body.indexOf("\"use_static_ip\":");
    if (idx >= 0) {
      use_static_ip = body.substring(idx + 15, idx + 19) == "true";
    }
    
    idx = body.indexOf("\"static_ip\":\"");
    if (idx >= 0) {
      int start = idx + 13;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(static_ip, sizeof(static_ip));
    }
    
    idx = body.indexOf("\"static_gateway\":\"");
    if (idx >= 0) {
      int start = idx + 18;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(static_gateway, sizeof(static_gateway));
    }
    
    idx = body.indexOf("\"static_subnet\":\"");
    if (idx >= 0) {
      int start = idx + 17;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(static_subnet, sizeof(static_subnet));
    }
    
    idx = body.indexOf("\"static_dns\":\"");
    if (idx >= 0) {
      int start = idx + 14;
      int end = body.indexOf("\"", start);
      String val = body.substring(start, end);
      val.toCharArray(static_dns, sizeof(static_dns));
    }
    
    saveConfig();
    server.send(200, "application/json", "{\"status\":\"ok\"}");
    
    Serial.println("Konfiguration gespeichert.");
    if (apMode) {
      Serial.println("Wechsel zu Station-Modus in 3 Sekunden...");
    } else {
      Serial.println("Neustart in 3 Sekunden...");
    }
    delay(3000);
    ESP.restart();
  } else {
    server.send(400, "application/json", "{\"error\":\"invalid request\"}");
  }
}

void setupWebServer() {
  Serial.println("\n=== WebServer Setup Start ===");
  
  // Routen registrieren
  server.on("/", HTTP_GET, handleRoot);
  server.on("/api/data", HTTP_GET, handleAPI);
  server.on("/api/config", HTTP_GET, handleConfigGet);
  server.on("/api/config", HTTP_POST, handleConfigPost);
  server.on("/api/wifi/scan", HTTP_GET, handleWifiScan);
  server.on("/api/logs", HTTP_GET, handleLogs);
  server.on("/api/diagnostics", HTTP_GET, handleDiagnostics);
  
  // Diagnose-Endpunkte
  server.on("/api/test/mqtt", HTTP_GET, handleTestMQTT);
  server.on("/api/test/wifi", HTTP_GET, handleTestWiFi);
  server.on("/api/test/ping", HTTP_GET, handleTestPing);
  server.on("/api/mbus/stats", HTTP_GET, handleMBusStats);
  server.on("/api/mbus/trigger", HTTP_POST, handleMBusTrigger);
  server.on("/api/errors/reset", HTTP_POST, handleErrorReset);
  
  // OTA Update über ArduinoOTA (Port 3232) - siehe ArduinoOTA.begin() in setup()
  // WebUI zeigt Anleitung für PlatformIO OTA Upload
  
