fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
  // Server starten auf Port 80
  server.begin();
  
  Serial.println("WebServer Routen registriert:");
  Serial.println("  GET  /");
  Serial.println("  GET  /api/data");
  Serial.println("  GET  /api/config");
  Serial.println("  POST /api/config");
  Serial.println("  GET  /api/wifi/scan");
  Serial.println("  GET  /api/logs");
  Serial.println("  ArduinoOTA aktiv (Port 3232)");
  
  String ip = apMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
  Serial.println(ANSI_GREEN "\n========================================" ANSI_RESET);
  Serial.println(ANSI_GREEN ANSI_BOLD "   WEBSERVER GESTARTET" ANSI_RESET);
  Serial.println(ANSI_GREEN "========================================" ANSI_RESET);
  Serial.println(ANSI_CYAN "Modus: " ANSI_RESET + String(apMode ? "Access Point" : "Station"));
  Serial.println(ANSI_CYAN "IP-Adresse: " ANSI_RESET ANSI_YELLOW ANSI_BOLD + ip + ANSI_RESET);
  Serial.println(ANSI_CYAN "Hostname: " ANSI_RESET + String(hostname));
  Serial.println(ANSI_CYAN "Port: " ANSI_RESET "80");
  Serial.println(ANSI_MAGENTA "\nZugriff:" ANSI_RESET);
  Serial.println(ANSI_YELLOW "  http://" + ip + ANSI_RESET);
  if (!apMode && strlen(hostname) > 0) {
    Serial.println(ANSI_YELLOW "  http://" + String(hostname) + ".local" ANSI_RESET);
  }
  Serial.println(ANSI_GREEN "========================================\n" ANSI_RESET);
}

// ---- Setup ----
void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println("\n\nESP32 Gaszähler Gateway v" + String(FIRMWARE_VERSION));
  Serial.println("================================");
  
  // Status LED
  pinMode(STATUS_LED_PIN, OUTPUT);
  digitalWrite(STATUS_LED_PIN, LOW);
  addLog("Hardware initialisiert");
  
  // Reset Button konfigurieren
  pinMode(RESET_BUTTON_PIN, INPUT_PULLUP);
  
  // Prfen ob BOOT-Button beim Start gedrckt ist (LOW = gedrckt)
  if (digitalRead(RESET_BUTTON_PIN) == LOW) {
    Serial.println(ANSI_RED ANSI_BOLD "\n*** CONFIG RESET ERKANNT ***" ANSI_RESET);
    Serial.println(ANSI_YELLOW "BOOT-Button war beim Start gedrckt." ANSI_RESET);
    Serial.println(ANSI_YELLOW "Lsche gespeicherte Konfiguration..." ANSI_RESET);
    
    preferences.begin("gas-config", false);
    preferences.clear();
    preferences.end();
    
    Serial.println(ANSI_GREEN "Konfiguration gelscht!" ANSI_RESET);
    Serial.println(ANSI_CYAN "Starte im Access Point Modus...\n" ANSI_RESET);
    
    // Defaults setzen
    strcpy(ssid, "SSID");
    strcpy(password, "Password");
    strcpy(hostname, "ESP32-GasZaehler");
    strcpy(mqtt_server, "192.168.178.1");
    mqtt_port = 1883;
    strcpy(mqtt_topic, "gaszaehler/verbrauch");
    poll_interval = 30000;
    
    delay(1000); // Warten damit Button losgelassen werden kann
  }
  
  addLog("Lade Konfiguration...");
  loadConfig();
  addLog("Starte WiFi...");
  setup_wifi();
  
  // Kurze Pause nach WiFi-Setup
  delay(1000);
  
  // mDNS starten (nur im Station-Modus)
  if (WiFi.status() == WL_CONNECTED && !apMode) {
    if (MDNS.begin(hostname)) {
      Serial.println("mDNS gestartet: " + String(hostname) + ".local");
      MDNS.addService("http", "tcp", 80);
    } else {
      Serial.println("mDNS Start fehlgeschlagen");
    }
  }
  
  // NTP Zeit initialisieren
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("Synchronisiere Zeit mit NTP...");
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)) {
      timeInitialized = true;
      Serial.println("Zeit synchronisiert");
    } else {
      Serial.println("Zeit-Synchronisation fehlgeschlagen");
    }
  }
  
  client.setServer(mqtt_server, mqtt_port);
  client.setBufferSize(512); // Grerer Buffer fr Discovery
  
  // Client-ID mit MAC-Adresse fr Eindeutigkeit
  uint8_t mac[6];
  WiFi.macAddress(mac);
  snprintf(mqtt_client_id, sizeof(mqtt_client_id), "ESP32Gas-%02X%02X%02X", mac[3], mac[4], mac[5]);
  Serial.println("MQTT Client-ID: " + String(mqtt_client_id));

  setupOTA();
  
  // WebServer starten (funktioniert sowohl im AP als auch Station-Modus)
  setupWebServer();
  
  // M-Bus initialisieren
  mbusSerial.begin(MBUS_BAUD, SERIAL_8E1, MBUS_RX_PIN, MBUS_TX_PIN);
  Serial.println("M-Bus UART bereit");
  
  mbusLastAction = millis() - poll_interval; // sofort Poll starten
  
  addLog("Setup abgeschlossen - System bereit");
  Serial.println(ANSI_GREEN ANSI_BOLD "Setup abgeschlossen!" ANSI_RESET);
  Serial.println(ANSI_CYAN "================================\n" ANSI_RESET);
}

// ---- Loop ----
void loop() {
  // Im AP-Modus nur WebServer und OTA
  if (apMode) {
    ArduinoOTA.handle();
    server.handleClient();
    updateStatusLED();
    return;
  }
  
  // WLAN Check
  if (WiFi.status() != WL_CONNECTED) {
    errorStats.wifiDisconnects++;
    logError("WLAN Verbindung verloren");
    setup_wifi();
  }
  
  if (!client.connected()) reconnect();
  client.loop();
  ArduinoOTA.handle();
  server.handleClient();
  updateStatusLED();
  
  // Memory Check alle 60 Sekunden
  unsigned long now = millis();
  if (now - lastMemoryCheck >= MEMORY_CHECK_INTERVAL) {
    checkMemory();
    lastMemoryCheck = now;
  }
  
  // Status alle 60 Sekunden ausgeben
  static unsigned long lastStatusPrint = 0;
  if (now - lastStatusPrint >= 60000) {
    Serial.println("\n[Status] WiFi: " + String(WiFi.status() == WL_CONNECTED ? "OK" : "FEHLER") + 
                   " | MQTT: " + String(client.connected() ? "OK" : "FEHLER") +
                   " | IP: " + WiFi.localIP().toString() +
                   " | Uptime: " + String(millis()/1000) + "s");
    lastStatusPrint = now;
  }
  
  // Home Assistant Discovery senden (einmalig nach Connect)
  if (client.connected() && !haDiscoverySent) {
    sendHomeAssistantDiscovery();
  }

  switch (mbusState) {
    case MBUS_IDLE:
      if (now - mbusLastAction >= poll_interval) {
        // Poll senden
        uint8_t pollFrame[5] = {0x10, 0x5B, 0x00, 0x5B, 0x16};
        mbusSerial.write(pollFrame, sizeof(pollFrame));
        mbusSerial.flush();
        mbusLen = 0;
        mbusLastAction = now;
        mbusState = MBUS_WAIT_RESPONSE;
        Serial.println("MBUS Poll gesendet, warte auf Antwort...");
        addLog("M-Bus: Poll gestartet");
      }
      break;

    case MBUS_WAIT_RESPONSE:
      while (mbusSerial.available() && mbusLen < sizeof(mbusBuffer)) {
        mbusBuffer[mbusLen++] = mbusSerial.read();
      }

      if ((now - mbusLastAction >= MBUS_RESPONSE_TIMEOUT) || mbusLen >= sizeof(mbusBuffer)) {
        mbusStats.totalPolls++;
        mbusStats.lastResponseTime = now - mbusLastAction;
        mbusStats.totalResponseTime += mbusStats.lastResponseTime;
        
        if (mbusLen > 0) {
          Serial.print("MBUS Antwort empfangen (");
          Serial.print(mbusLen);
          Serial.print(" Bytes, ");
          Serial.print(mbusStats.lastResponseTime);
          Serial.println("ms)");
          addLog("M-Bus: Antwort erhalten (" + String(mbusLen) + " Bytes, " + String(mbusStats.lastResponseTime) + "ms)");
          
