fgrfn/ESP32-BK-G4-Gasmeter/src/main.cpp
          // Hex Dump speichern
          mbusStats.lastHexDump = "";
          String hexLog = "";
          for (size_t i = 0; i < min(mbusLen, (size_t)32); i++) {
            char hex[4];
            sprintf(hex, "%02X ", mbusBuffer[i]);
            mbusStats.lastHexDump += hex;
            hexLog += hex;
          }
          if (mbusLen > 32) hexLog += "...";
          addLog("M-Bus: Rohdaten - " + hexLog);

          float volume = parseGasVolumeBCD(mbusBuffer, mbusLen);
          if (volume >= 0) {
            mbusStats.successfulPolls++;
            
            // Durchschnittliche Antwortzeit berechnen
            mbusStats.avgResponseTime = mbusStats.totalPolls > 0 ? 
              (mbusStats.totalResponseTime / mbusStats.totalPolls) : 0;
            
            char payload[16];
            dtostrf(volume, 0, 2, payload);
            
            // Volumen publishen (retained so Home Assistant always has latest state)
            if (client.publish(mqtt_topic, payload, true)) {
              Serial.print("Verbrauch gesendet: ");
              Serial.println(payload);
              addLog("M-Bus: Verbrauch OK - " + String(payload) + " m³");
              
              // Energie berechnen und publishen (für Energy Dashboard)
              float energy_kwh = volume * gas_calorific_value * gas_correction_factor;
              char energy_payload[16];
              dtostrf(energy_kwh, 0, 1, energy_payload);
              String energy_topic = String(mqtt_topic) + "_energy";
              client.publish(energy_topic.c_str(), energy_payload, true); // retained!
              Serial.print("Energie gesendet: ");
              Serial.print(energy_payload);
              Serial.println(" kWh");
              addLog("MQTT: Energie - " + String(energy_payload) + " kWh (Zählerstand: " + String(payload) + " m³, Brennwert: " + String(gas_calorific_value, 6) + ", Z-Zahl: " + String(gas_correction_factor, 6) + ")");
              
              // Additional HA sensors (nach Energy-Publish)
              String wifiTopic = String(mqtt_topic) + "_wifi";
              client.publish(wifiTopic.c_str(), String(WiFi.RSSI()).c_str(), true); // retained!
              
              String rateTopic = String(mqtt_topic) + "_mbus_rate";
              float rate = mbusStats.totalPolls > 0 ? (mbusStats.successfulPolls * 100.0 / mbusStats.totalPolls) : 0;
              client.publish(rateTopic.c_str(), String(rate, 1).c_str(), true); // retained!
            } else {
              errorStats.mqttErrors++;
              logError("MQTT Publish fehlgeschlagen");
              addLog("MQTT: Publish Fehler");
            }
            
            // Verlauf speichern mit echter Zeit wenn verfgbar
            lastVolume = volume;
            unsigned long timestamp;
            if (timeInitialized) {
              timestamp = time(nullptr);
            } else {
              // Fallback: Unix-Timestamp schätzen basierend auf millis()
              // Verwende einen Basis-Timestamp (01.01.2024) + millis/1000
              timestamp = 1704067200 + (millis() / 1000);
            }
            measurements.push_back({timestamp, volume});
            if (measurements.size() > MAX_MEASUREMENTS) {
              measurements.erase(measurements.begin());
            }
            
            // Alle 10 Messungen persistieren
            static int saveCounter = 0;
            saveCounter++;
            if (saveCounter >= 10) {
              saveHistory();
              saveCounter = 0;
            }
          } else {
            Serial.println("Kein Volumenwert gefunden!");
            errorStats.mbusParseErrors++;
            logError("M-Bus Parse Fehler");
          }
        } else {
          Serial.println("Keine MBUS Antwort erhalten");
          errorStats.mbusTimeouts++;
          logError("M-Bus Timeout");
        }
        mbusState = MBUS_IDLE; // wieder bereit fr nchsten Poll
      }
      break;
  }
}



